package il.kmi.app.domain

import il.kmi.shared.domain.Belt

object Explanations {
    fun get(belt: Belt, item: String): String =
        when (belt) {
            Belt.YELLOW -> getYellow(item)
            Belt.ORANGE -> getOrange(item)
            Belt.GREEN  -> getGreen(item)
            Belt.BLUE   -> getBlue(item)
            Belt.BROWN  -> getBrown(item)
            Belt.BLACK  -> getBlack(item)
            else        -> "הסבר מפורט על: $item"
        }
}


    private fun getYellow(item: String): String {
        return when (item) {
                                    // ───── חגורה צהובה ─────
            // ───── כללי ─────
            "בלימת רכה לפנים" -> "פיסוק קל. נפילה לפנים על כפות הידיים ובלימת הגוף במרפקים כפופים. דגשים: ראש לצד, גוף ישר, ברכיים נעולות, עקבים מתוחים לאחור. אין לזרוק רגליים לאחור"
            "בלימה לאחור" -> "צעד לאחור. סנטר לחזה. בלימה בכפות ידיים כלפי הקרקע באצבעות צמודות. ירידה והמשך הנפילה על הגב. כתפיים, ראש ומרפקים באוויר, הידיים חוזרות מעל החזה מוכנות להגנה. כף הרגל שצעדה לאחור מונחת על הרצפה והרמת האגן תוך הרמת עקב. הרגל השניה כפופה לכיון הכתף מוכנה לבעיטה"
            "תזוזות" -> "צעדי התקדמות, נסיגה וצעדים לצדדים. התקדמות - רגל שמאל מתקדמת וצמצום ברגל ימין לעמידת מוצא. נסיגה - רגל ימין לאחור וצמצום רגל שמאל לעמידת מוצא. לשמאל - צעד לצד בשמאל וצמצום לעמידת מוצא ברגל ימין. לימין - צעד בימין לצד וצמצום ברגל שמאל לעמידת מוצא"
            "גלגול לפנים – צד ימין" -> "גלגול קדימה באלכסון על הכתף הימנית, גב עגול, ידיים צמודות, סיום בעמידה או מצב הגנה"
            "הוצאות אגן, הרמת אגן והפניית גוף למעלה " -> "תרגול כוח מהאגן: הרמת אגן תוך שכיבה על הגב, הפניית גוף כלפי מעלה לשחרור ולבניית בסיס הגנה"
            "צל בוקס" -> "תרגול קרב מול יריב דמיוני: מכות, בעיטות ותזוזות באוויר, לשיפור תיאום, קואורדינציה ועמידה"
            "סגירת אגרוף" -> "סגירה ב-3 שלבים: א. קיפול פרקי האצבעות העליונים כלפי מטה. ב. סגירה לאגרוף. ג. האגודל סוגר על האצבעות מלמטה. הקפדה על אגרוף סגור כולו"
            "אצבעות לפנים" -> "פיסוק קל. צעד לאחור והפניית גוף בניצב לתוקף תוך הושטת היד הקרובה לתוקף באצבעות ישרות וצמודות, ליצירת לחץ על שקע גורגרת התוקף. שמירת פנים ביד השניה. הערה: בלימוד ילדים יש להחליף לפיסת יד לבית החזה"
            "מכת קשת האצבע והאגודל" -> "פיסוק קל. צעד לאחור והפניית גוף בניצב לתוקף תוך הושטת קשת האגודל והאצבע למכה בקנה הנשימת התוקף ושמירת פנים ביד השניה. הערה: בלימוד ילדים יש להחליף את המכה במכת פיסת יד לבית החזה"

            // ───── עמידת מוצא ─────
            "עמידת מוצא רגילה" -> "כל עמידות המוצא מעמידת פיסוק קלה. רגל ימין לאחור, עקב ימין מעט מעל הקרקע, אצבעות רגל שמאל מעט ימינה, ברכיים משוחררות. משקל במרכז"
            "עמידת מוצא להגנות פנימיות" -> "יש ללמד עמידות מוצא תוך הדגמת מהות ההגנה הפנימית והחיצונית. מרפקים כפופים כלפי מטה, כפות הידיים כלפי פנים"
            "עמידת מוצא להגנות חיצוניות" -> "ידיים מושטות לפנים במרפקים כפופים כלפי מטה רחוקים מהגוף, כפות הידיים כלפי התוקף ובמרווח חושף פנים המגרה התקפה ישירה"
            "עמידת מוצא צידית" -> "יד שמאל מושטת לפנים מרפק מכופף כף היד פונה פנימה. יד ימין עוברת את קו כתף שמאל. עמידה זו מתאימה לפריצות"
            "עמידת מוצא כללית מספר 1" -> "יד שמאל עוברת את ירך ימין בהטיית כתף שמאל פנימה (הקטנת מטרה). יד ימין עוברת כתף שמאל"
            "עמידת מוצא כללית מספר 2" -> "יד שמאל מושטת לפנים. מרפק מכופף מעט כלפי מטה. כף יד פונה לתוקף. יד ימין עוברת את קו מותן שמאל, ברכיים מכופפות לעמידה נמוכה (להקטנת המטרה ולהגדלת שטח ההגנה)"

            // ───── עבודת ידיים ─────
            // ───── מרפק ─────
            "מכת מרפק אופקית לפנים" -> "מרפק נשלח קדימה במקביל לקרקע לעבר חזה או פנים היריב."
            "מכת מרפק אנכי למטה" -> "מכה חדה עם המרפק כלפי מטה לעבר ראש או כתף יריב."
            "מכת מרפק אנכי למעלה" -> "מכה כלפי מעלה עם המרפק לעבר סנטר היריב."
            "מכת מרפק לאחור" -> "מרפק נשלח אחורה כלפי בטן או חזה יריב מאחוריך."
            "מכת מרפק לאחור למעלה" -> "מכה כלפי מעלה עם המרפק מאחוריך, מיועדת לפנים או לסנטר."
            "מכת מרפק אופקית לאחור" -> "מבט מעבר לכתף. הרמת מרפק לצד, גב היד כלפי מעלה, אמה אופקית. מכת מרפק אופקית לאחור בסיבוב עקב נגדי"
            "מכת מרפק אופקית לצד" ->  "פיסוק קל. הרמת מרפק לצד, גב היד כלפי מעלה, אמה אופקית. מכת מרפק לצד תוך צעד לצד וצמצום העמידה ברגל השניה"

            // ───── פיסת יד ─────
            "מכת פיסת יד שמאל לפנים" -> "אצבעות כלפי מעלה ישרות, אגודל צמוד. המכה בפיסת כף היד. המכה מסתיימת במרפק מכופף מטה. תוך העברת משקל לפנים. מכה קצרה"
            "מכת פיסת יד ימין לפנים" ->  "בכל מכה ביד ימין מעמידת מוצא. יש לסובב עקב ואגן ימין להארכת התנועה ולעוצמתה. אצבעות כלפי מעלה ישרות. אגודל צמוד. המכה בפיסת כף היד. המכה מסתיימת במרפק מכופף מטה, תוך סיבוב עקב ואגן ימין. מכה קצרה"
            "מכת פיסת יד שמאל-ימין לפנים" -> "מכת פיסת יד שמאל לפנים. עם החזרת המכה מכת פיסת יד ימין לפנים"
            "מכת פיסת יד שמאל-ימין-שמאל לפנים" -> "מכת פיסת יד שמאל לפנים. עם החזרת המכה - מכת פיסת יד ימין לפנים ועם החזרת מכת ימין - מכת פיסת שמאל לפנים בהתקדמות"
            "מכת פיסת יד מהצד" -> "אצבעות מופנות כלפי הגוף אגודל צמוד. מרפק הצידה ומכה בפיסת כף היד מהצד"


            // ───── אגרופים ישרים ─────
            "אגרוף שמאל לפנים" ->  "הושטת יד שמאל מאוגרפת בהעברת משקל לפנים וסיבוב האגרוף למצב אופקי"
            "אגרוף ימין לפנים" -> "הושטת יד ימין מאוגרפת תוך סיבוב עקב ואגן ימין וסיבוב האגרוף למצב אופקי"
            "אגרוף שמאל-ימין לפנים" -> "אגרוף שמאל לפנים. עם החזרת אגרוף שמאל - מכת אגרוף ימין לפנים"
            "אגרוף שמאל בהתקדמות" ->  "בתנועה אחת: צעד בשמאל ואגרוף שמאל לפנים תוך העברת משקל לשמאל. עם החזרת אגרוף שמאל צמצום ברגל ימין לעמידת מוצא"
            "אגרוף ימין בהתקדמות" ->  "צעד בשמאל לפנים. אגרוף ימין תוך צמצום ברגל ימין לעמידת מוצא והפניית עקב ואגן"
            "אגרוף שמאל-ימין בהתקדמות" -> "בתנועה אחת: צעד בשמאל ואגרוף שמאל לפנים. עם החזרת אגרוף שמאל - אגרוף ימין לפנים תוך צמצום בסיבוב עקב ואגן ימין לעמידת מוצא"
            "אגרוף שמאל-ימין ושמאל בהתקדמות" -> "אגרוף שמאל לפנים. עם החזרת אגרוף שמאל - מכת אגרוף ימין לפנים ועם החזרת אגרוף ימין - אגרוף שמאל לפנים בהתקדמות"
            "אגרוף שמאל בנסיגה" -> "בתנועה אחת: צעד בימין לאחור תוך אגרוף שמאל לפנים. עם החזרת אגרוף שמאל צמצום ברגל שמאל לעמידת מוצא"
            "אגרוף שמאל למטה בהתקפה" -> "כיפוף ברכיים תוך אגרוף שמאל לפלג גוף תחתון והעברת משקל לפנים"
            "אגרוף ימין למטה בהתקפה" -> "כיפוף ברכיים תוך סיבוב עקב ימין ומותן ואגרוף ימין לפלג גוף תחתון"
            "אגרוף שמאל למטה בהגנה" -> "כיפוף ברכיים תוך הטיית הגוף ימינה להגנה ואגרוף שמאל לפלג גוף תחתון"
            "אגרוף ימין למטה בהגנה" -> "כיפוף ברכיים תוך הטיית הגוף שמאלה להגנה בסיבוב עקב ואגן ימין. אגרוף ימין לפלג גוף תחתון"

            // ───── מכות מגל וסנוקרת ─────
            "מכת מגל שמאל" -> "מכת מגל באגרוף שמאל מאונך עובר את מרכז הגוף תוך סיבוב עקב ואגן שמאל. כנגד תוקף קרוב"
            "מכת מגל ימין" -> "מכת מגל באגרוף ימין מאונך עובר את מרכז הגוף תוך סיבוב עקב ואגן ימין. כנגד תוקף קרוב"
            "מכת מגל למטה ולמעלה בהתחלפות" -> "מכות מגל לצלעות ולראש ברצף"
            "מכת סנוקרת שמאל" -> "הנמכת כתף ומרפק שמאל תוך סיבוב האגרוף כשגב היד לתוקף. מכה באלכסון למעלה כלפי התוקף תוך הרמת עקב שמאל. כנגד תוקף קרוב ונמוך"
            "מכת סנוקרת ימין" -> "הנמכת כתף ומרפק ימין תוך סיבוב האגרוף כשגב היד לתוקף. המכה באלכסון למעלה כלפי התוקף תוך הרמת עקב ימין. כנגד תוקף קרוב ונמוך"

            // ───── בעיטות ─────
            "בעיטה רגילה למפסעה" -> "הרמת ברך גבוהה לפנים. הצלפה למפסעה בכרית כף הרגל, שני מצבים לרגל הבסיס"
            "בעיטה רגילה לסנטר" -> "הרמת ברך גבוהה לפנים. הצלפה לסנטר בכרית כף הרגל, שני מצבים לרגל הבסיס"
            "בעיטת ברך נמוכה למפסעה" -> "תפיסת כתף נגדית בשתי ידיים ומשיכתה כלפי מטה תוך הרמת ברך לפגיעה במפסעה"
            "בעיטת ברך גבוהה" -> "תפיסת עורף ומשיכתו לצד תוך הרמת ברך גבוהה לפגיעה בחזה / פנים"
            "בעיטת ברך מהצד" -> "תפיסת כתף נגדית ומשיכתה כלפי מטה תוך הרמת ברך מהצד לפגיעה בצלעות"
            "בעיטת מגל אופקית" ->  "הרמת ברך אופקית תוך סיבוב רגל הבסיס והפניית גוף. יישור השוק לבעיטה בכרית כף הרגל וחזרה למצב אופקי"
            "בעיטת מגל אלכסונית" ->  "הרמת רגל באלכסון תוך סיבוב רגל הבסיס. הפגיעה ללא מטרה מוגדרת"
            "בעיטת מגל בהטעיה" -> "הרמת ברך לפנים ושינוי לבעיטת מגל אופקית"
            "בעיטת מגל נמוכה" -> "בעיטת מגל בעצם השוק לירך התוקף"
            "בעיטה לצד מעמידת פיסוק" -> "רגל בסיס בזוית 45 מעלות. הרמת ברך לפנים ובעיטה בעקב תוך הטעיית גוף לצד הנגדי ומבט לכיוון התוקף"

            // ───── שחרורים ─────
            // ───── שחרורים מתפיסות ידיים ─────
            "שחרור מתפיסת יד מול יד" ->  "הפניית האגודל לכיון פתח התפיסה ומנוף בעזרת המרפק. יד שנייה שומרת פנים"
            "שחרור מתפיסת יד נגדית" -> "הפניית האגודל לכיון פתח התפיסה ומשיכה החוצה לשחרור. יד שנייה שומרת פנים"
            "שחרור מתפיסת שתי ידיים למטה" -> "הפניית האגודלים לכיון פתח התפיסה תוך הרמת הידיים לכיון התוקף"
            "שחרור מתפיסת שתי ידיים למעלה" -> "הפניית הזרתות לכיון פתח התפיסה. הורדת הידיים תוך צעד לאחור ומבט לתוקף"
            "שחרור מחביקת צוואר מהצד" -> "ברגל הרחוקה צעד נמוך ומחליק עם כיוון המשיכה תוך סיבוב והפניית גוף אל התוקף למניעת נפילה. בתנועה אחת מכת יד למפסעה ויד שנייה עולה מאחור לנקודת תורפה בראש. משיכה והורדה לקרקע"

            // ───── שחרורים מחניקות ─────
            "מניעת התקרבות תוקף" -> "תלוי בטווח מהתוקף: טווח רחוק בעיטה, טווח קרוב: מכת קשת האגודל או לחץ אצבעות על שקע הגורגרת. (ניתן לבצע בכל התקרבות התוקף)"
            "מניעת חניקה" -> "פיסוק קל. צעד לאחור והפניית גוף בניצב לתוקף תוך הושטת היד במכת קשת האגודל והאצבע למכה בשקע גורגרת התוקף ושמירת פנים ביד השניה. הערה: בלימוד ילדים יש להחליף את מכת הקשת והאגודל והאצבע במכת פיסת היד לבית החזה"
            "שחרור מחניקה מלפנים בכף היד" -> "יד מאונקלת משחררת חניקה תוך צעד לאחור והפניית גוף בניצב לתוקף. ביד הקרובה, מלמטה, בין שתי ידי התוקף, מכת פיסת יד לפנים. תפיסת כתף נגדית. משיכת כתף תוך צעד רדיפה וברך למפסעה"
            "שחרור מחניקה מאחור במשיכה" -> "שתי ידיים מאונקלות משחררות חניקה. צעד באלכסון לאחור בהתאם לכיון המשיכה. שחרור יד למכה למפסעה והמשך התנועה למכת מרפק לסנטר"

            // ───── הכנה לעבודת קרקע ─────
            "הוצאת אגן" -> "משכיבת המוצא, מבט מלוה את התנועה. שתי הידיים דוחפות (ימינה) ורגל (שמאל) דוחפת ומוציאה את האגן שמאלה לאחור תוך הפנית הגוף לשכיבה כפופה על צד ימין. קימה מהירה"
            "הרמת אגן והפניית גוף לכיון ההפלה" -> "משכיבת המוצא, מבט מלוה את התנועה, מבט מלוה את התנועה. הרמת אגם גבוהה ומהירה. יד (שמאל) מובילה באלכסון ורחוק ימינה מעבר לקו הכתף ומעל קו הראש תוך הפנית הגוף והישענות על כתף (ימין). המשך התנועה ימינה לעליה על שתי הברכיים. קימה מהירה"
            "מוצא לעבודת קרקע" -> "לשכב על הגב. רגלים בקירוס ברוחב האגן, עקבים קרובים לעכוז"

            // ───── הגנות ─────
            "הגנות חיצוניות רפלקסיבית 360 מעלות" -> "ההגנות - עם ראיית ההתקפה ורחוקות מגוף המגן. ההגנות כנגד שורש כף יד התוקף קרוב לנקודת יציאת ההתקפה. פיסוק קל. הגנות בכף היד, אצבעות ישרות וצמודות. הסטת יד התוקף פנימה ואליו תוך הטיית ראש לצד היד המסיטה (הגנות רפלקסיביות)"
            "הגנה פנימית רפלקסיבית" -> "עמידת מוצא להגנות פנימיות. הסטת האגרוף בכף יד שמאל. החלקת כף היד לאורך זרוע התוקף תוך צעד בשמאל לצד המת, הפניית גוף ואגרוף ימין לצלעות. תפיסת זרוע התוקף ביד שמאל והמשך אגרוף ימין לפנים"
            "הגנה פנימית נגד ימין בכף יד שמאל" -> "עמידת מוצא להגנות פנימיות. הסטת האגרוף בכף יד שמאל. החלקת כף היד לאורך זרוע התוקף תוך צעד בשמאל לצד המת, הפניית גוף ואגרוף ימין לצלעות. תפיסת זרוע התוקף ביד שמאל והמשך אגרוף ימין לפנים"
            "הגנה פנימית נגד שמאל בכף יד ימין" -> "עמידת מוצא להגנות פנימיות. הסטת האגרוף בכף יד ימין תוך הטיית ראש ימינה ואגרוף שמאל לפנים"
            "הגנה פנימית נגד בעיטה רגילה למפסעה" -> "פיסוק קל. הסטה רחוקה מהגוף בכף יד שמאל לכיוון ברך התוקף תוך הגנת פנים ביד ימין. צעד בשמאל לצד המת והפניית גוף תוך חסימת ותפיסת זרוע ימין תוקף ביד שמאל ואגרוף ימין לפנים (הגנה רפלקסיבית)"

            else -> "הסבר מפורט על: $item"
        }
    }

        // ─────────── חגורה כתומה ───────────
        private fun getOrange(item: String): String {
            return when (item) {
                // ----- כללי -----
                "בלימה לצד ימין" ->  "פיסיק קל. שיכול לצד לכיון הנפילה תוך הצמדת הברך השניה לחזה. בלימה ביד הקרובה למזרון באצבעות צמודות, מרפק באויר, ראש גבוה. כף רגל השיכול על הקרקע קרובה לעכוז"
                "בלימה לצד שמאל" ->  "פיסיק קל. שיכול לצד לכיון הנפילה תוך הצמדת הברך השניה לחזה. בלימה ביד הקרובה למזרון באצבעות צמודות, מרפק באויר, ראש גבוה. כף רגל השיכול על הקרקע קרובה לעכוז"
                "גלגול לפנים צד שמאל" ->  "רגל שמאל לפנים. ידיים לפנים כף יד שמאל ימינה וכף יד ימין ישרה לפנים. ראש ימינה ולמטה. גלגול דרך כתף שמאל לאגן ימין. ברך ימין מכופפת הצידה וקרסול ימין מתחת לברך שמאל קימה דרך ברך ימין וכריות כפות הרגליים לעמידת מוצא"
                "גלגול לאחור צד ימין" -> "ירידה לאחור על ברך ימין. יד שמאל ישרה וצמודה לצד הגוף. יד ימין לכיון כתף שמאל. גלגול דרך כתף שמאל בברכיים מכופפות וקימה לעמידת מוצא"
                "גלגול לאחור צד שמאל" ->  "ירידה לאחור על ברך ימין. יד שמאל ישרה וצמודה לצד הגוף. יד ימין לכיון כתף שמאל. גלגול דרך כתף שמאל בברכיים מכופפות וקימה לעמידת מוצא"
                "שילובי ידיים רגליים" ->  "תרגול של תנועות רציפות המשלבות מכות ידיים ובעיטות להגברת הקואורדינציה"

                // ----- מכות יד -----
                "מכת גב יד בהצלפה" ->  "מכה חדה עם גב כף היד תוך הצלפה מהירה לעבר פני היריב"
                "מכת גב יד בהצלפה בסיבוב" -> "גרסה סיבובית של מכת גב יד – ניצול תנופה להגברת עוצמה"
                "מכת פטיש" -> "הנחתת מכה חדה עם חלק האגרוף התחתון כמו פטיש"
                "מכת פטיש מהצד" ->  "מכת פטיש מהצד לעבר הראש או הכתף של היריב"

                // ----- בעיטות -----
                "בעיטה רגילה בעקב לסנטר" -> "הרמת ברך גבוהה. ופגיעה בסנטר בעקב"
                "בעיטת הגנה לפנים" -> "עמידת מוצא. הרמת ברך לפנים. בעיטת דקירה בכרית כף הרגל / כף הרגל / עקב, למרכז גוף התוקף מסביב"
                "בעיטת סנוקרת לאחור" -> "הגב מופנה לתוקף. מבט מעבר לכתף. הרמת עקב לאחור בהצלפה. (כשהפנים אל התוקף, מע.מ. צידית ובשיכול אחורי)"
                "בעיטה לצד בשיכול" -> "עמידת מוצא צידית. שיכול מאחורי הרגל הבועטת. בעיטה לצד והחזרת הרגל הבועטת בשיכול קדמי"
                "בעיטה רגילה לאחור" -> "הגב מופנה לתוקף. הנפת רגל לאחור בין שתי רגלי התוקף. (כשהפנים אל התוקף, מע.מ. צידית ובשיכול אחורי)"
                "בעיטה לצד בנסיגה" -> "רגל אחת נסוגה. רגל שנייה בועטת בעיטה נמוכה לצד. מבט אל התוקף וחוזרת בשיכול קדמי (בעיטה הגנתית)"
                "בעיטת הגנה לאחור" -> "הגב מופנה לתוקף. הרמת ברך ב-90 מעלות לפנים ובעיטה לאחור תוך כיפוף הגב לפנים. מבט מעבר הכתף. (כשהפנים אל התוקף, מע.מ. צידית והבעיטה בשיכול אחורי)"
                "בעיטת סטירה פנימית" -> "עמידת מוצא רגילה. הרמת ברך החוצה ופגיעה במטרה בכף הרגל"
                "בעיטת עצירה בכף הרגל האחורית" -> "הרמת הרגל לעצירה עם ראיית הבעיטה. אצבעות הרגל האחורית פונות חוצה. דגש: תזמון"
                "בעיטת עצירה בכף הרגל הקדמית" -> "הרמת הרגל לעצירה עם ראיית הבעיטה. אצבעות הרגל הקדמית פונות פנימה, דגש: תזמון"
                "בעיטה רגילה ובעיטת מגל ברגל השנייה" -> "בעיטה רגילה, יורדת לפנים ובעיטת מגל ברגל השנייה"
                "שילובי בעיטות" -> "להדגיש שילובים נכונים של בעיטות, דגש שהרגל שנוחתת לאחר הבעיטה תהיה במצב לבעיטה הבאה"
                "ניתור ברגל ימין ובעיטה רגילה ברגל ימין" -> "ניתור בימין, הרמת ברך שמאל, בעיטה בימין ונחיתה בשמאל (בעיטת מספרת)"

                // ----- הגנות -----
                // ----- הגנות נגד מכות ישרות -----
                "הגנות נגד מכות עם הטיות גוף" -> "8 הגנות גוף: 1.לפנים ימין 2.לפנים שמאל 3.לצד ימין 4.לצד שמאל 5.למטה 6.לאחר 7. לאחור ימין 8.לאחור שמאל"
                "הגנה פנימית נגד שמאל עם מרפק" ->  "עמידת מוצא להגנות פנימיות, הרמת מרפק ימין תוך הגגה בגב האמה והמשך התנועה למכת גב יד לפנים"
                "הגנה פנימית נגד מכות ישרות למטה" -> "עמידת מוצא להגנות פנימיות. הגנה פנימית באמה, ביד מונמכת, מרפק מוביל (דקירות), רחוק מהגוף"
                "הגנה נגד שמאל-ימין - אגרוף מהופך" -> "עמידת מוצא כללית מס' 1. הגנה פנימית באמת שמאל נגד אגרוף שמאל והמשך באגרוף מהופך כנגד הימין"
                "הגנה נגד שמאל-ימין - הטייה לאחור" -> "עמידת מוצא רגילה. עם ראיית אגרוף שמאל צעד לאחור תוך הטיית גוף לאחור והרמת הידיים. ביד שמאל מאונקלת הורדת יד ימין תוקף תוך התקפה באגרוף ימין לפנים"
                "הגנה נגד שמאל-ימין (כמו חיצוניות)" -> "עמידת מוצא כללית מס' 1. הגנה פנימית באמת שמאל נגד אגרוף שמאל והמשך בהגנות חיצוניות כמו נגד אגרוף ימין באמת שמאל נגד הימין תוך אגרוף ימין לפנים"

                // ----- הגנות חיצוניות נגד מכות -----
                    "הגנה חיצונית מס' 1" -> "עמידת מוצא להגנות חיצוניות. הגנה בגב אמת שמאל מחוץ לגוף. כף היד כלפי מעלה. סיבוב עקב ואגן ואגרוף בימין. מתאפיינת בתנועת הגנה חזקה"
                    "הגנה חיצונית מס' 2" -> "עמידת מוצא להגנות חיצוניות. הגנה באמת שמאל מחוץ לגוף, זרת החוצה. סיבוב עקב ואגן ואגרוף בימין. מתאפיינת בתנועת הגנה מהירה"
                    "הגנה חיצונית מס' 3" -> "עמידת מוצא להגנות חיצוניות. הגנה באמת שמאל מעל הראש. סיבוב עקב ומותן ואגרוף בימין. מיועדת לנמוך נגד גבוה"
                    "הגנה חיצונית מס' 4" -> "עמידת מוצא להגנות חיצוניות. הגנה באמת שמאל מעל הראש תוך כיפוף ברכיים. סיבוב עקב ואגן ואגרוף בימין. מיועדת לגבוה נגד נמוך"
                    "הגנה חיצונית מס' 5" -> "עמידת מוצא להגנות חיצוניות. הגנה ביד שמאל ישרה תוך פריצה ברגל שמאל, הנמכת הראש ואגרוף בימין"
                    "הגנה חיצונית מס' 6" -> "עמידת מוצא בין כללית מס' 2 לבין חיצוניות. בנטיית האמה פנימה. הגנה בהרמת אמת שמאל. סיבוב עקב ואגן ואגרוף בימין. מתבצעת כלפי תוקף חזק וגדול"

                // ----- הכנה לעבודת קרקע -----
                "הגנה נגד אגרופים בשכיבה" -> "משכיבת המוצא, הגנות פנימיות. בשתי ידים מעונקלות תפיסת יד התוקף והצמדתה לגוף המגן. הרמת אגן והפנית הגוף לכיון היד התפוסה חהפלת התוקף. קימה מהירה"

                // ----- הגנות חיצוניות נגד מכות מהצד -----
                "הגנה נגד מכה גבוהה מהצד - התוקף בצד שמאל" -> "ביד שמאל הגנה 360/1. צעד בימין לצד חי תוקף ואגרוף ימין"
                "הגנה נגד מכה מהצד לעורף - התוקף בצד שמאל" -> "ביד שמאל הגנה 360/2. צעד בימין לצד חי תוקף ואגרוף ימין"
                "הגנה נגד מכה מהצד לגב - התוקף בצד שמאל" -> "ביד שמאל הגנה 360/2 או 360/3. צעד בימין לצד חי תוקף ואגרוף ימין"
                "הגנה נגד מכה גבוהה מהצד - התוקף בצד ימין" -> "ביד ימין הגנה 360/1. צעד בשמאל לצד מת תוקף ואגרוף בשמאל"
                "הגנה נגד מכה מהצד לגרון - התוקף בצד ימין" -> "ביד ימין הגנה 360/2. החלפת ידיים תוך שמירת יד התוקף בשמאל והתקפה בימין לצואר לתוקף"
                "הגנה נגד מכה מהצד לבטן - התוקף בצד ימין" -> "ביד ימין הגנה 360/4 והתקפה באגרוף שמאל תוך צעד לצד המת"

                // ----- הגנות נגד בעיטות -----
                "הגנה חיצונית נגד בעיטה רגילה" -> "עמידת מוצא כללית מס' 1. הגנה חיצונית - דקירה רחוקה מהגוף באמת ימין תוך צעד בשמאל לצד המת והתקפה באגרוף שמאל"
                "הגנה נגד בעיטה רגילה - עצירה ברגל הקדמית" -> "עמידת מוצא רגילה. עצירה בכף הרגל הקדמית לכיוון שוק התוקף. אצבעות כף הרגל פונות פנימה. תזמון"
                "הגנה נגד בעיטת ברך" -> "עמידת מוצא רגילה. הצמדת הזרועות לצלעות, מרפקים כלפי מטה. בשתי הידיים מכת מרפק לפנים מטה. יד אחת תפגע בירך התוקף, ביד השניה מכת מרפק גבוהה לפנים"
                "הגנה נגד בעיטה רגילה - עצירה ברגל האחורית" -> "עמידת מוצא רגילה. עצירה בכף הרגל האחורית לכיוון שוק התוקף. אצבעות כף הרגל פונות החוצה. תזמון"
                "הגנה חיצונית נגד בעיטת מגל לפנים - בעיטה בימין" -> "עמידת מוצא כללית מס' 1. הגנה חיצונית בגב אמת שמאל, משקל הגוף על רגל שמאל ובעיטה למפסעה בימין. דגש: הגנה רחוקה מהגוף, עיקר ההגנה היא הבעיטה"
                "הגנה חיצונית נגד בעיטת מגל לפנים - בעיטה בשמאל" -> "עמידת מוצא כללית מס' 1. הגנה חיצונית בגב אמת שמאל, משקל הגוף על רגל ימין ובעיטה למפסעה בשמאל. דגש: הגנה רחוקה מהגוף, עיקר ההגנה היא הבעיטה"
                "הגנה נגד בעיטת מגל לפנים באמות הידיים" -> "עמידת מוצא רגילה. הגנה פנימית באמות תוך צעד בימין ומכת גב יד ימין בהצלפה. (אין חשיבות למיקום הידיים)"
                "הגנה חיצונית נגד בעיטת מגל לפנים - אגרוף בימין" -> "עמידת מוצא כללית מס' 1. הגנה חיצונית בגב אמת שמאל, צעד לפנים בימין ואגרוף בימין. דגש: הגנה רחוקה מהגוף"
                "בעיטת עצירה נגד בעיטת מגל - עצירה ברגל האחורית" -> "עמידת מוצא רגילה. עצירה בכף רגל אחורית לירך התוקף, בבעיטת סטירה פנימית. תזמון"
                "בעיטת עצירה נגד בעיטת מגל - עצירה ברגל הקדמית" -> "עמידת מוצא רגילה. עצירה בכף רגל קדמית לירך התוקף, אצבעות כף הרגל פונות חוצה. תזמון"
                "בעיטת עצירה נגד בעיטה לצד" -> "עמידת מוצא רגילה. עצירה בכף הרגל הקדמית לכיוון השוק, אצבעות כף הרגל פונות פנימה. תזמון"

                // ----- הגנות נגד סכין -----
                "הגנות יד רפלקסיביות נגד דקירות רגילות" -> "פיסוק קל, בתנועה אחת הגנת 360 ואגרוף ביד השניה. המשך ברצף מכות ובעיטות. (יש ללמד גם בשמאל)"
                "הגנות יד רפלקסיביות נגד דקירות מזרחיות" -> "פיסוק קל, בתנועה אחת הגנת 360 ואגרוף ביד השניה. המשך ברצף מכות ובעיטות. אין להזיז את הגוף בזמן ההגנה (יש ללמד גם בשמאל)"
                "הגנות יד רפלקסיביות נגד דקירה ישרה" -> "הגנה פנימית רפלקסיבית. והמשך ברצף מכות ובעיטות"

                // ----- שחרורים -----
                // ----- שחרורים מתפיסות ידיים -----
                "שחרור מתפיסת יד מול יד - בריח על האגודל" -> "ביד שמאל, בריח על אגודל התוקף ושחרור"
                "שחרור מתפיסת יד נגדית - פרקי אצבעות" -> "מכת פרקי אצבעות על גב כף יד התוקף"
                "שחרור מתפיסת יד בשתי ידיים למעלה" -> "הכנסת היד הפנויה בין ידי התוקף ותפיסת אגרוף היד התפוסה. הרמת מרפק היד המשחררת לבריח ומשיכת היד התפוסה תוך צעד לאחור ומבט אל התוקף"
                "שחרור מתפיסת יד בשתי ידיים למטה - מרווח" -> "כאשר הידיים האוחזות מרווחות - הכנסת היד הפנויה בין ידי התוקף, תפיסת אגרוף היד התפוסה ומשיכתה החוצה תוך צעד לאחור"
                "שחרור מתפיסת יד בשתי ידיים למטה - צמוד" -> "כאשר הידיים האוחזות צמודות - בשורש כף יד מאונקלת שחרור יד אחת כשתנועת השחרור בהכנסת היד באזור מרפק התוקף והחלקתה כלפי מטה לשחרור במשיכה החוצה. ביד התפוסה שחרור יד מול יד"
                "שחרור מתפיסת ידיים צמודה מאחור" -> "אפשרויות: רקיעה, מכה למפסעה, מרפק אופקי לאחור"

                // ----- שחרורים מתפיסות זרוע -----
                "שחרור מתפיסת זרוע מהצד במשיכה" -> "צעד עם כיוון המשיכה מחוץ לגוף התוקף תוך מכה למפסעה ביד התפוסה ומכה לפנים ביד הפנויה / צעד אל התוקף ומכה לפנים ביד הפנויה"
                "שחרור מתפיסת זרוע מהצד בדחיפה" -> "בעיטה לצד בנסיגה לברך התוקף"

                // ----- שחרורים מתפיסות חולצה -----
                "שחרור חולצה - בריח על האגודל" -> "תפיסת שורש כף היד תוך צעד לאחור ובריח על אגודל התוקף להורדת היריב למטה"
                "שחרור חולצה - מכת פרקי אצבעות" -> "במידה והאגודל כלפי מטה מכה על פרקי האצבעות תוך צעד לאחור"
                "שחרור חולצה - שתי ידיים" -> "צעד לאחור. מכת פרקי אצבעות על יד אחת ובריח על אגודל ביד השניה"

                // ----- שחרורים מתפיסות שיער -----
                "שחרור מתפיסת שיער מלפנים" -> "1. תפיסה גבוהה. אפשרויות: משיכת שיער לאחור, הרחקה באגודלים מתחת לאף, עיניים, מכת פיסת יד מהצד ללסת תוך התחמקות בסיבוב להפלה. 2. תפיסה נמוכה. אפשרויות: מכות מרפק אנכיות למטה, תפיסה בנקודת תורפה בראש ומכה לאף, לעיניים"
                "שחרור מתפיסת שיער מלפנים בשתי ידיים" -> "כיפוף ברכיים וגב להורדת מרכז הכובד תוך תפיסת ידי התוקף. אפשרויות: מבט ושתי מכות מרפק אופקיות לאחור, רקיעה על גב כף הרגל, בעיטה בעקב לשוק"

                // ----- שחרורים מתפיסות צוואר וגוף -----
                "שחרור חביקת צואר מלפנים" -> "ביד הקרובה מכה למפסעה. ביד השניה מאונקלת, שחרור אמת התוקף והמשך התקפות"
                "שחרור מחביקה פתוחה מלפנים" -> "אפשרויות: נשיכה. מכה למפסעה בכפות ידיים צמודות להרחקת התוקף, תפיסת שכמות וברך למפסעה. רקיעה לגב כף הרגל"
                "שחרור מחביקה פתוחה מאחור" -> "כיפוף ברכים. ראשיה לאחור. הוצאת העכוז שמאלה, מכה למפסעה בימין ורקיעה ברגל ימין על גב כף רגל שמאל תוקף"
                "שחרור מחביקת צואר מהצד בשכיבה" -> "דגשים: עקבים קרובים לעכוז. קימה מהירה והימום התוקף. היד המשוחררת תופסת נקודת תורפה בראש ומושכת הצידה תוך הרמת אגן והפניית גוף עם כיוון המשיכה. מכה למפסעה ביד השניה"
                "שחרור מחביקת צואר ויד מהצד בשכיבה" -> "היד המשוחררת תופסת נקודת תורפה בראש ומושכת הצידה תוך הרמת אגן והפניית גוף עם כיוון המשיכה. הוצאת היד התפוסה ומכה למפסעה"

                // ----- שחרורים מחניקות -----
                "שחרור מחניקה מלפנים בדחיפה" -> "יד שמאל מאונקלת משחררת חניקה תוך צעד לאחור בשמאל בניצב לתוקף. הרמת יד ימין מעל שורש כף יד תוקף, הצמדתה לאוזן. הורדתה מאונכת מעל ידי התוקף והמשך התנועה למכת מרפק אופקית לצד"
                "שחרור מחניקה מאחור בדחיפה" -> "צעד בימין לפנים תוך הרמת יד שמאל והצמדתה לאוזן לבריח. סיבוב אל התוקף דרך צד שמאל, לצד המת, מחוץ לרגלי התוקף. מכה בימין. אחיזת התוקף בשתי הידיים והתקפת ברך שמאל לגוף התוקף"
                "שחרור מחניקה מהצד - מרחוק" -> "יד מאונקלת הרחוקה מהתוקף משחררת חניקה. ביד הקרובה מלמטה בין שתי ידי התוקף מכת פיסת יד לפנים. תפיסת כתף נגדית משיכה תוך צעד רדיפה וברך למפסעה"
                "שחרור מחניקה מהצד - מקרוב" -> "יד מאונקלת הרחוקה מהתוקף משחחרת חניקה ביד הקרובה מכה למפסעה והמשך התנועה למכת מרפק גבוהה "
                "שחרור מחנקה מהצד בשכיבה" -> "יד מאונקלת רחוקה מהתוקף משחררת חניקה. ביד השניה מכה לשרעפת. ברך נכנסת ודוחפת. הוצאת אגן לאחור. בעיטה ברגל הרחוקה והמשך ברצף בעיטות. קימה מהירה"

                else -> "הסבר מפורט על: $item"
            }
        }

    // ─────────── חגורה ירוקה ───────────
private fun getGreen(item: String): String {
    return when (item) {

// ─────────── מכות מרפק ───────────
        "מכת מרפק נגד קבוצה" ->  "צעד לאחור בימין תוך הפניית גוף ימינה כנסיגה. חזרה לתוקפים בסיבוב דרך כתף שמאל ופריצה בימין תוך התקפה באמת ימין הודפת לפנים וצעד עם אגרוף שמאל, אל התוקפים הצדדיים ביותר"

        // ─────────── בעיטות ───────────
        "בעיטת רגילה ובעיטת מגל באותה רגל" -> "ברגל האחורית בעיטה רגילה וחזרה לעמידת מוצא. בעת החזרה: בעיטת מגל"
        "בעיטת סטירה חיצונית" -> "ברגל האחורית סיבוב פנימה, מבט מעבר לכתף ובעיטת סטירה חיצונית"
        "בעיטת מגל לאחור בשיכול אחורי" -> "סיבוב אחורה (180 מעלות), רגל ימין משתכלת על רגל שמאל תוך הכנת הבעיטה. המשך סיבוב ובעיטת מגל לאחור"
        "בעיטה לצד בסיבוב" -> "סיבוב פנימה ברגל הקדמית. מבט מעבר לכתף ובעיטה לצד ברגל האחורית"


        // ─────────── בלימות וגלגולים ───────────
        "בלימה לאחור מגובה" -> "שכיבה על הגב, סנטר צמוד לחזה, גב מעוגל, רגליים וידיים באוויר"
        "בלימה לצד כהכנה לגזיזות" -> "שכיבה על צד ימין. יד ימין תומכת בראש. יד שמאל על הגוף. הרמת שתי רגליים והטייתן לצד"
        "גלגול לפנים ובלימה לאחור – ימין" -> "רגל ימין לפנים, ראש שמאלה ולמטה. גלגול דרך כתף ימין. סיום בבלימה לאחור"
        "גלגול לפנים ובלימה לאחור – שמאל" -> "רגל ימין לפנים, ראש שמאלה ולמטה. גלגול דרך כתף ימין. סיום בבלימה לאחור"
        "גלגול לפנים ולאחור – ימין" -> "רגל ימין לפנים, ראש שמאלה ולמטה. גלגול דרך כתף ימין. קימה תוך כדי גלגול לאחור"
        "/גלגול לפנים ולאחור – שמאל" -> "רגל ימין לפנים, ראש שמאלה ולמטה. גלגול דרך כתף ימין. קימה תוך כדי גלגול לאחור"
        "גלגול ביד אחת – ימין" -> "רגל ימין לפנים, ראש שמאלה ולמטה. גלגול דרך כתף ימין. קימה תוך כדי גלגול על יד ימין"
        "גלגול ביד אחת – שמאל" -> "רגל ימין לפנים, ראש שמאלה ולמטה. גלגול דרך כתף ימין. קימה תוך כדי גלגול על יד ימין"
        "גלגול לפנים – קימה לפנים" -> "רגל ימין לפנים, ראש שמאלה ולמטה. גלגול דרך כתף ימין וקימה לפנים"

        // ─────────── קאוולר ───────────
        "קוואלר – הליכה לאחור" -> "קוואלר על ידי ימין. ביד שמאל תפיסת תחתית ושורש כף ידך התקף. ביד ימין תפוס את אגרוף ארוך התקף כשמרכז כף היד על הפרקים. סבוב אגרוף התקף פונה מחוץ לגוף. התקף מונח קל על הכתף ולמטה תוך צעד בשמאל לאחור ואז שחרר (הרפה) את התקף עם הנפה קלה לשמאל"
       "קוואול נגד ההתנגדות – הליכה לפנים" -> "קוואלר על ידי ימין. ביד שמאל תפיסת תחתית ושורש כף ידך התקף. ביד ימין תפוס את אגרוף ארוך התקף כשמרכז כף היד על הפרקים. סבוב אגרוף התקף פונה מחוץ לגוף. עם ההתנגדות – הליכה לפנים. הצד התחתון מונח קל על הכתף. המשך הנפת הקוואלר למעלה להרפיה"
       "קוואול – אגודלים" -> "קוואלר על ידי ימין. בשתי הידיים תפיסת שורש כף ידך התקף. האגודלים לוחצים על גב כף ידך התקף, משתמשים בשתי ידיים (ימין, שמאל) כדי לייצר מתח על האגרוף. סבוב אגרוף התקף פונה מחוץ לגוף. הרפיה של התקף"
       "קוואול – מרפק" -> "קוואלר על ידי ימין. ביד שמאל תפיסת שורש כף ידך התקף. מגע קצר ימין אגרוף לפנים על גב כף ידך התקף תוך צעד בשמאל לאחור והרפיה של גוף שמאל להרפיית התקף"

        // ─────────── שחרורים מחניקות ───────────
        "הגנה נגד חניקת צלב - עם נקודת תורפה" -> "מכת אגרוף לפנים או מרפק כלפי מעלה. ימין מאונקלת משחררת חניקה. יד שמאל תופסת נקודת תורפה בראש ומורידה את התוקף."
        "שחרור מחניקה מלפנים בידיים ישרות" -> "יד מאונקלת משחררת חניקה. הרמת אגן והפניית גוף לכיוון היד המשחררת"
        "שחרור מחניקה מאחור בידיים ישרות" -> "יד מאונקלת משחררת חניקה. צעד בימין לאחור ופריצת טווח המגע"
        "שחרור מחניקה מאחור - הטיה לאחור" -> "הרמת ידיים מאונקלות. הטיית גוף לאחור תוך דחיפה בידיים כלפי מטה אל ידי התוקף"

            // ─────────── שחרורים מחביקות ───────────
        "שחרור מחביקת גוף מאחור - ידיים כפופות" -> "יד מאונקלת אוחזת באמת התוקף. גוף כפוף לפנים. בעיטה רגילה לאחור למפשעה. מרפק אופקית לאחור אל ראש התוקף"
        "שחרור מחביקת גוף מאחור - ידיים ישרות" -> "יד מאונקלת אוחזת באמת התוקף. גוף כפוף לפנים. בעיטה רגילה לאחור למפשעה. פריקת בריח על יד התוקף"
        "שחרור מחביקת גוף מלפנים - ידיים כפופות" -> "יד מאונקלת מכה בראש. בעיטה רגילה למפסעה. מרפק אנכית למעלה אל סנטר התוקף"
        "שחרור מחביקת גוף מלפנים - ידיים ישרות" -> "יד מאונקלת מכה בראש. בעיטה רגילה למפסעה. פריקת בריח על יד התוקף"

        // ─────────── הגנות נגד מכות ───────────
        "הגנה חיצונית נגד ימין באגרוף מהופך" -> "הגנה חיצונית ביד שמאל תוך צעד לפנים בימין. החזרת הרגל הקידמית לאחור תוך נסיגה ואגרוף מהופך ימין"
        "הגנה חיצונית נגד שמאל" -> "עמידת מוצא כללית מס' 1 (רגל שמאל קדימה). הגנה חיצונית ביד שמאל. צעד לפנים ברגל שמאל תוך המשך התקפה ברצף"
        "הגנה חיצונית נגד שמאל בהתקדמות" -> "עמידת מוצא כללית מס' 1 (רגל שמאל קדימה). הגנה חיצונית ביד שמאל. צעד ברגל ימין לאלכסון ימין"
        "הגנה פנימית נגד ימין באמת שמאל" -> "עמידת מוצא כללית מס' 1 (רגל שמאל קדימה). הגנה פנימית באמת שמאל. צעד לפנים ברגל שמאל תוך המשך התקפה ברצף"
        "הגנה פנימית נגד שמאל באמת שמאל" -> "עמידת מוצא כללית מס' 2 (רגל ימין קדימה). הגנה פנימית באמת שמאל. צעד לפנים ברגל שמאל תוך המשך התקפה ברצף"

            // ─────────── הגנות נגד מקל ───────────
        "הגנה נגד מכת מקל אנכית מלמעלה - צד חי" -> "עמידת מוצא כללית מס' 2 (רגל ימין קדימה). ביד שמאל הגנה חיצונית. צעד בשמאל לפנים תוך המשך התקפה, ברך ימין לפנים"
        "הגנה נגד מכת מקל אנכית מלמעלה - צד מת" -> "עמידת מוצא כללית מס' 1 (רגל שמאל קדימה). ביד ימין הגנה חיצונית. צעד בשמאל לפנים לצד מת התוקף. אגרוף שמאל לפנים"
        "הגנה נגד מכת מקל בסיבוב - צד חי" -> "פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן, פריצה ברגל שמאל. ביד שמאל הגנה חיצונית 360/1. צעד בימין לצד החי תוך המשך תנועה, מכת מרפק אופקית בימין, ברך ימין, סיבוב והורדת התוקף. (יש ללמד גם בשמאל)"
        "הגנה נגד מכת מקל בסיבוב - צד מת" -> "פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן, פריצה ברגל שמאל. ביד שמאל הגנה חיצונית 360/1. צעד בימין לצד המת תוך המשך תנועה, מכת מרפק אופקית בימין, ברך ימין, סיבוב והורדת התוקף. (יש ללמד גם בשמאל)"

        // ─────────── הגנות נגד בעיטות ───────────
        "הגנה נגד בעיטה רגילה - בעיטה לצד" -> "עמידת מוצא צידית. סיבוב רגל הבסיס הרחוקה מהתוקף תוך בעיטה לצד ברגל הקרבה"
        "הגנה נגד בעיטה רגילה – טיימינג לצד חי" -> "עמידת מוצא צידית. סיבוב רגל בבסיס המרחק מתוך בעיטה לצד ברגל הקרובה. פיסוק קל: צעד רדיפה לצד החי. הנפת גוף בצד לעומת בעיטה, עמידה מוצלבת להגנות חיצוניות. הגנה דקירה רחוקה מהגוף ביד שמאל תוך ימין בכיפוף לצד החי, והתקפת באגרוף ימין"
        "הגנה חיצונית באמת שמאל נגד בעיטה רגילה" -> "עמידת מוצא להגנות חיצוניות. הגנת דקירה רחוקה מהגוף ביד שמאל תוך צעד בימין לפנים לצד החי והתקפה באגרוף ימין"
        "הגנה נגד בעיטת מגל לפנים – בעיטה לצד" -> "עמידת מוצא צידית. סיבוב רגל הבסיס הרחוקה מהתוקף תוך בעיטה לצד ברגל הקרובה"
        "הגנה נגד בעיטת מגל נמוכה" -> "הרמת ברך לפנים בעיטה קלה לכיוון הבעיטה, תוך הטיית מרפק לכיוון הברך להגדלת שטח ההגנה. הגנה מתבצעת בשוק קדמית והורדת רגל תוך התקפה"
        "הגנה נגד בעיטת מגל לאחור - בעיטה בימין" ->  "עמידת מוצא הפוכה כללית מספר 1. הגנה בגב אמת ימין ובעיטה למפסעה בימין"
        "הגנה נגד בעיטת מגל לאחור - בעיטה שמאל" ->  "עמידת מוצא הפוכה כללית מספר 1. הגנה בגב אמת ימין ובעיטה למפסעה בשמאל"
        "הגנה נגד בעיטת מגל לאחור - אגרוף שמאל" -> "עמידת מוצא הפוכה כללית מספר 1. הגנה בגב אמת ימין. צעד לפנים בשמאל ואגרוף בשמאל"
        "הגנה נגד בעיטת מגל לאחור בסיבוב – בעיטה" -> "עם תחילת הסיבוב, בעיטת הגנה לעצם הזנב. דגש: בזמן התרגול הבעיטה לעכוז"
        "הגנה חיצונית באמת ימין נגד בעיטה לצד" -> "עמידת מוצא כללית מס' 1. הגנה חיצונית: דקירה רחוקה מהגוף באמת ימין. צעד בשמאל לצד המת תוך הפניית גוף והתקפה באגרוף שמאל"
        "הגנה חיצונית באמת שמאל נגד בעיטה לצד" -> "עמידת מוצא להגנות חיצוניות. הגנה חיצונית: דקירה רחוקה מהגוף באמת שמאל. תוך צעד בימין לצד החי, הפניית גוף והתקפה באגרוף ימין"
        "הגנה נגד בעיטת לצד בעיטת סטירה חיצונית" -> "עמידת מוצא כללית ממס' 2. צעד בימין באלכסון לפנים לצד החי להגנת גוף תוך בעיטת סטירה חיצונית בשמאל או בעיטה לצד לברך התוקף, שמירת גוף ביד שמאל ושמירת פנים בימין"

        // ─────────── הגנות מאיום סכין ───────────
        "הגנה מאיום סכין לעורק שמאל" -> "ביד שמאל מאונקלפת, משיכת יד הסכין שמאלה ולמטה מקו הכתף והצמדתה לגוף המגן תוך צעד בשמאל לאחור והפניית גוף בניצב לתוקף ואגרופים בימין לפנים. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין לעורק ימין" -> "ידיים תופסות מעל יד הדוקר והצמדתה לגוף תוך צעד בשמאל לצד המת ואגרופים בשמאל לפנים. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין להב לגורגרת" -> "יד התוקף כפופה (ביד שמאל הדיפת הסכין שמאלה והצמדתה לגוף התוקף תוך צעד בשמאל לצד המת ואגרופים בימין לפנים. (יד התוקף ישרה) 1. בתנועה אחת משיכת אמת התוקף מטה והצמדתה לגוף המגן תוך בעיטה למפסעת ההתקף. 2. יד ימין מגן מאונקלפת משחררת ומצמידה את יד התוקף אל גוף המגן מתחת לקו הכתף תוך צעד בימין לאחור כשיד התוקף לרוחב גוף התוקף ואגרוף שמאל לפנים. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין מלפנים - חוד הסכין לגורגרת" -> "בשתי ידיים תפיסת שורש כף ידך ההתקף בתצורת קוואלר. הורדה והדבקה של ידך האוחזת לכיוון ההתקף תוך בעיטה למפסעה בהמשך לקוואלר. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין מאחור - להב הסכין לגורגרת" -> "ביד ימין מאונקלפת, משיכת ידך ימין למטה וימין מניף חוד ההגן ימינה, מטה. שמאל למפסעה והמשך למכת מרפק אגבית גבוהה לאחור לסנטר. יד ימין משנה תפיסת ידך ההתקף כלפי מטה. יד שמאל מצטרפת לתפיסת היד. יציאה לאחור ברגל שמאל והנפת חדה של ידך ההתקף לאחור ומעלה תוך בעיטה בימין. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין מלפנים - חוד לבטן תחתונה" -> "ביד שמאל מאונקלפת שורש כף יד ההתקף חזק דוחפת יד ימין למטה ושמאל, הנפת יד שמאל להרחקת הסכין ואגרוף ימין לפנים. במקרה שהיא זזה (נעה): נגיעה והמשך התקפה. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין מאחור - חוד לגב" -> "מבט לאחור. השטת יד שמאל רחוק מהגוף תוך צעד לאחור בשמאל בסיבוב והנפת הגוף לצד החי. תפיסת יד ההתקף והצמדתה בין כתף לזרוע. מתיחה למטה לגובה הכתף. אגרוף ימין, ברך ימין והמשך התקפה. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה רגילה – בעיטה" -> "פיסוק קל. צעד קטן באלכסון לצד המטרה ובעיטה רגילה למפסעה. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה מזרחית – בעיטה" -> "פיסוק קל. צעד רדיפה לצד החי, תוך הנפת הגוף לצד החי בבעיטת צד ובעיטה רגילה למפסעה. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה ישרה מלפנים – בעיטה" -> "פיסוק קל. הטיית גוף לאחור תוך הרמת שתי ידיים לשמירת פנים ובעיטה לאזור הירכיים / בית השחי של ההתקף. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה ישרה נמוכה – בעיטה" -> "פיסוק קל. צעד רדיפה לצד החי תוך הנפת הגוף לצד החי בבעיטת צד ובעיטה רגילה לסנטר. (כמו נגד מזרחית. יש ללמד גם בשמאל)"
        "הגנה נגד דקירה ישרה מלפנים – הגנת גוף ובעיטת מגל למפסעה" -> "פיסוק קל. צעד באלכסון לצד המטרה תוך הטיית הגוף לצד היציאה קדימה ובעיטת מגל למפסעה ברגל ימין. ביד ימין מגן תפיסת זרוע היד הדוקרת. בעיטת מגל מעל שקע הברך והורדת הרגל. אגרוף בשמאל. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה רגילה מהצד - בעיטה"  -> "בעיטה לצד (ישנה אפשרות לבעיטה רגילה)"
        "הגנה נגד דקירה ישרה - בעיטה" -> "בעיטה לצד (ישנה אפשרות לבעיטה רגילה)"
        "הגנה נגד דקירה מזרחית מהצד - בעיטה" -> "בעיטה לצד (ישנה אפשרות לבעיטה רגילה)"
        "הגנה נגד דקירה רגילה מהצד - התוקף בצד ימין" -> "ביד ימין הגנה 360/1. צעד בשמאל לצד מת תוקף ואגרוף שמאל. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה רגילה מהצד - התוקף בצד שמאל" -> "ביד שמאל הגנה 360/1. צעד בימין לצד חי תוקף ואגרוף ימין. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה מזרחית מהצד לעורף - התוקף בצד שמאל" -> "ביד ימין הגנה 360/1. צעד בשמאל לצד מת תוקף ואגרוף שמאל. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה מזרחית מהצד לגב - התוקף בצד שמאל" -> "ביד שמאל הגנה 360/1. צעד בימין לצד חי תוקף ואגרוף ימין. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה מזרחית מהצד לגרון - התוקף בצד ימין" -> "ביד ימין הגנה 360/2. החלפת ידיים תוך שמירת יד התוקף בשמאל והתקפה באמת ימין לצוואר התוקף"
        "הגנה נגד דקירה מזרחית מהצד לבטן - התוקף בצד ימין" -> "ביד ימין הגנה 360/4 והמשך התנועה לתפיסת יד התוקף. התקפה באגרוף שמאל"

        else -> "הסבר מפורט על: $item"
    }
}

// ─────────── חגורה כחולה ───────────
private fun getBlue(item: String): String {
    return when (item) {

                // ─────────── בלימות וגלגולים ───────────
        "מניעת נפילה מחביקת שוקיים מלפנים להפלה" -> "התחמקות בזריקת הרגליים לאחור בפיסוק נח תוך הישענות על גוף התוקף. חביקת עורף התוקף ביד הקרובה ואגרופים לפנים ביד השניה"
        "גלגול לצד – ימין/שמאל" -> "מתגלגלים לצד על יד אחת. סנטר נוגע בחזה וממשיכים את הגלגול על שתי השכמות"
        "גלגול ברחיפה - ימין/שמאל" -> "ריצה. רחיפה. בלימה בידיים והמשך גלגול לפנים"
        "גלגול לגובה - ימין/שמאל" -> "ריצה. ניתור לגובה. בלימה בידיים והמשך גלגול לפנים"
        "גלגול ללא ידיים - ימין/שמאל" -> "רגל ימין לפנים. ראש שמאלה ולמטה. גלגול דרך כתף ימין כשברך שמאל מכופפת הצידה וקרסול שמאל מתחת לברך ימין , קימה דרך ברך שמאל וכריות כפות הרגליים לעמידת מוצא"


            // ─────────── בעיטות ───────────
           "בעיטת פטיש" -> "הנפת הרגל הבועטת באלכסון פנימה והורדתה בכח אנכית למטה. הפגיעה בחלק האחורי של העקב. הבעיטה ברגל הקדמית או האחורית. בעיטה זו יש לבצע כשהמטרה כפופה"
           "בעיטת גזיזה אחורית" -> "(המגן בעמידת מוצא רגילה. התוקף בעמידת מוצא רגל ימין לפנים) . צעד רדיפה לצד המת. גזיזה בחלק האחורי של שוק ימין ליד העקב. ניתן לבצע על רגל אחת או על שתי רגלי התוקף"
           "בעיטת גזיזה קדמית" -> "(המגן בעמידת מוצא רגילה. התוקף בעמידת מוצא רגל ימין לפנים) . צעד רדיפה לצד המת תוך הפניית גוף ב-180 מעלות מאחורי התוקף. גזיזה בגב כף הרגל / תחילת השוק שמאל, על רגל ימין תוקף"
          "בעיטת גזיזה קדמית ובעיטת גזיזה אחורית בסיבוב" -> "בועטים בעיטת גזיזה קדמית (התוקף הרים את הרגל הנגזזת) ממשיכים בבעיטת גזיזה לאחור בסיבוב, לגזיזת הרגל השנייה"
          "בעיטת מגל לאחור בסיבוב" -> "סיבוב פנימה ברגל קדמית. מבט מעבר לכתף. המשך הסיבוב ובעיטת מגל לאחור ברגל האחורית"
          "בעיטת סטירה חיצונית בסיבוב" -> "סיבוב פנימה ברגל קדמית. מבט מעבר לכתף. המשך הסיבוב ובעיטת סטירה חיצונית ברגל האחורית"


        // ─────────── שחרורים מתפיסות ידיים ───────────
        "שחרור תפיסת ידיים בשכיבה" -> "דגשים: עקבים קרובים לעכוז. קימה מהירה והימום התוקף. הורדת המרפקים והצמדת הזרועות לגוף תוך הרמת אגן והפניית גוף. הרמת יד לשמירת פנים. הדיפת התוקף הצידה"

            // ─────────── שחרורים מחביקות ───────────
        "שחרור מחביקת צואר מהצד והפלה" ->  "שחרור מחביקת צואר מהצד. עם הנפילה היד המשוחררת תופסת נק'. תורפה בראש ומשוכת הצידה תוך הרמת אגן והפניית גוף עם כיון המשיכה , מכה למפסעה ביד השניה"
        "שחרור מחביקת צואר מאחור עם נעילה" -> "יד ימין מאונקלת תופסת את אמת התוקף תוך הפנית ראש לכיון שקע המרפק. יד שמאל דוחפת מלמטה את מרפק התוקף כלפי מעלה. ברגל ימין צעד שמאלה תוך הפנית גוף אל התוקף ויציאה מהירה מגוף התוקף. יש לבצע את התרגיל לפני נעילת הבריח"
        "שחרור מחביקת צואר בשכיבה ברכיבה צמודה" -> "ביד הנגדית למיקום ראש התוקף, תפיסת נקודת תורפה בראש. ביד השנייה אגרוף לצלעות תוך הרמת אגן והפניית הגוף עם כיוון הגוף , להפיכת התוקף"


        // ─────────── שחרורים מחניקות ───────────
        "שחרור מחניקה לקיר - מלפנים לא צמודה" ->  "יד מאונקלת משחררת חניקה. ביד השניה פיסת יד מהצד מעל ידי התוקף. יציאה הצידה והמשך ניטרול"
        "שחרור מחניקה לקיר - צמודה מלפנים" ->  "יד מאונקלת משחררת חניקה. יד שנייה תופסת נקודת תורפה בראש להרחקת התוקף. ברך למפסעה ויציאה הצידה"
        "שחרור מחניקה לקיר - צמודה מאחור" ->  "יד מאונקלת משחררת יד אחת. יציאה מהקיר והתקפה"
        "שחרור מחניקה לקיר - דחיפה מאחור" -> "ראש הצידה בלימה לקיר בשתי ידיים. הרמת יד שמאל והצמדתה לאוזן לבריח. סיבוב אל התוקף דרך צד שמאל, לצד המת, מחוץ לרגלי התוקף והתקפה"
        "שחרור מחניקה בשכיבה – ידיים כפופות" -> "דגשים: עקבים קרובים לעכוז. קימה מהירה והימום התוקף. ביד מאונקלת שחרור יד אחת. ביד השנייה מכת פיסת יד לפנים. הרמת אגן והפניית גוף לכיוון היד המשחררת להפיכת התוקף והתקפה (כמו שחרור חניקה מלפנים)"
        "שחרור מחניקה בשכיבה – ידיים ישרות" ->  "ביד מאונקלת שחרור יד אחת. זרוע שנייה נצמדת לאוזן, למנוף על שורש כף יד התוקף, והמשך התנועה במרפק פנימה לבריח. הרמת אגן והפניית גוף לכיוון היד המשחררת להפיכת התוקף והתקפה (כמו שחרור חניקה מלפנים בדחיפה)"
        "שחרור מחניקה צמודה בשכיבה" -> "ביד מאונקלת שחרור יד אחת. ביד השנייה תפיסת נקודת תורפה בראש. הרמת אגן והפניית גוף לכיוון היד המשחררת להפיכת התוקף והתקפה"
        "שחרור מחניקה מהצד בשכיבה" ->  "ביד מאונקלת רחוקה מהתוקף שחרור חניקה תוך מכת פיסת יד ביד הקרובה והכנסת ברך. הוצאת אגן. רצף בעיטות וקימה מהירה"

        // ─────────── הגנות מאיום סכין  ───────────
        "הגנה מאיום סכין לעורק שמאל" -> "ביד שמאל מאונקלת, משיכת יד הסכין שמאלה ולמטה מקו הכתף והצמדתה לגוף המגן , אגרופים בימין לפנים ויציאה הצידה מהקיר וניטרול. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין לעורק ימין" -> "ביד שמאל הדיפת קו יד הסכין שמאלה והצמדתה לגוף התוקף. אגרופים בשמאל לפנים ויציאה הצידה מהקיר וניטרול. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין – להב לגרגרת" -> "א: יד התוקף כפופה. ביד שמאל הדיפת הסכין שמאלה והצמדתה לגוף התוקף אגרפים בימין לפנים ויציאה מהקיר. ב: יד התוקף ישרה: 1. בתנועה אחת משיכת אמת התוקף מטה והצמדתה לגוף המגן תוך בעיטה למפסעת התוקף ויציאה מהקיר. 2. יד ימין מגן מאונקלת משחררת ומצמידה את יד התוקף אל גוף המגן מתחת לקו הכתף כשיד התוקף לרוחב גוף התוקף ואגרוף שמאל לפנים ויציאה הצידה מהקיר וניטרול. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין מלפנים – חוד הסכין לגרגרת" -> "בשתי ידיים תפיסת שרש כף יד התוקף בתצורת קוואלר. הורדה ודחיפת היד האוחזת לכיון התוקף תוך בעיטה למפסעה וניטרול. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין מאחור – להב הסכין לגרגרת" -> "שתי הידיים בולמות לקיר. ביד ימין מאונקלת, משיכת יד הסכין למטה וימינה תוך הזזת האגן ימינה , מכת שמאל למפסעה והמשך למכת מרפק אנכית גבוהה לאחור לסנטר. יד ימין משנה תפיסת יד התוקף ללפיתה. יד שמאל מצטרפת לתפיסת היד. הנפה חדה של יד התוקף לאחור ולמעלה תוך בעיטה בימין ויציאה הצידה מהקיר וניטרול. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין מאחור – חוד לגב" ->  "שתי ידיים בולמות לקיר. מבט לאחור. הושטת יד שמאל רחוק מהגוף בסיבוב והפניית הגוף לצד החי. תפיסת יד התוקף והצמדתה בין האמה לזרוע מתחת לגובה הכתף. אגרוף ימין, ברך ימין, המשך התקפה ויציאה מהקיר וניטרול. (יש ללמד גם בשמאל)"
        "הגנה מאיום סכין מאחור – להב על העורף" -> "שתי הידיים בולמות לקיר. הרמת יד ימין אופקי לאחור גבוה מעל יד התוקף (כמו בשחרור חניקה מאחור לקיר) תוך צעד בימין ליציאה רחוקה ימינה מחוץ לקו התקיפה וניטרול. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה מזרחית – יד" -> "הגנה חיצונית אלכסונית 360/4 תוך צעד לפנים לצד המת והפניית גוף. תפיסת יד התוקף תוך אגרוף לפנים והמשך קוואלר בצעד לאחור. הורדת התוקף. היד התפוסה של התוקף ישרה ומתוחה בין שתי רגלי המגן והמשך להשתלטות. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה ישרה נמוכה" -> "הגנה חיצונית 360/4 תוך צעד באלכסון לפנים לצד המת והפניית גוף. תפיסת יד התוקף תוך אגרוף לפנים והמשך קוואלר בצעד לאחור. הורדת התוקף. היד התפוסה של התוקף ישרה ומתוחה בין שתי רגלי המגן והמשך להשתלטות. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה ישרה מהצד – צד מת" ->  "הגנה חיצונית רפלקסיבית ובעיטה לצד לברך התוקף. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה ישרה מהצד – צד חי" -> "הגנה פנימית רפלקסיבית ובעיטה לצד לברך התוקף. (יש ללמד גם בשמאל)"
        "הגנה פנימית נגד דקירה ישרה – צד חי" -> "עמידת מוצא כללית מס' 1 הפוכה - ברכיים כפופות. ידיים בגובה הסכין. הגנה פנימית באמת ימין. צעד בימין תוך מכת אמת ימין לצוואר התוקף ותפיסת הזרוע הדוקרת ביד שמאל. המשך תנועת ימין לתפיסת צוואר ימין תוקף. בעיטה ברגל שמאל למפסעה ובעיטת ברך בימין. (יש ללמד גם בשמאל)"
        "הגנה פנימית נגד דקירה ישרה – צד מת" -> "עמידת מוצא כללית מס' 1 - ברכיים כפופות. ידיים בגובה הסכין. הגנה באמת שמאל תוך צעד בשמאל לפנים לצד המת. תפיסת אמת היד הדוקרת בשמאל ואגרוף ימין. קוואלר והמשך להשתלטות. (יש ללמד גם בשמאל)"

// ─────────── הגנות נגד בעיטות ───────────
        "הגנה נגד בעיטת ברך מלפנים" ->  "עמידת מוצא רגילה מול התוקף , הורדת המרפקים כלפי מטה , עם ראיית בעיטת הברך, הורדת היד והדיפת היריב לאחור ומכת מרפק אנכית למעלה"
        "הגנה נגד בעיטת ברך מהצד" ->  "הורדת הידיים למטה , ליפוף הירך והטלה תוך כדי מכה לפנים"
        "הגנה נגד בעיטה רגילה – סייד-סטפ לצד המת" ->  "פיסוק קל או עמידת מוצא רגילה. עם ראיית הבעיטה סייד-סטפ לצד המת. אפשרויות: אגרוף שמאל ימין או גזיזה קדמית בשמאל - תזמון"
        "הגנה נגד בעיטה רגילה – סייד-סטפ לצד החי" ->  "פיסוק קל או עמידת מוצא רגילה. עם ראיית הבעיטה סייד סטפ לצד החי תוך אגרוף ימין לפנים ובעיטה רגילה למפסעה בשמאל. תזמון"
        "הגנה נגד בעיטת מגל לפנים עם השוק" ->  "ביד שמאל חביקת השוק והצמדתה לגוף המגן תוך צעד לצד בימין ואגרוף בימין לפנים"
        "הגנה נגד בעיטת מגל לצלעות" ->  "אפשרות א - עמידת מוצא רגילה. ביד שמאל, מלמעלה, ליפוף רגל התוקף , צעד בימין לצד החי והתקפה ביד ימין אפשרות ב - עמידת מוצא כללית 2 , ביד שמאל, מלמטה להרמת רגל התוקף , גזיזה ימין"
        "הגנה פנימית נגד בעיטת מגל לפנים — בעיטה לצד" ->  "עמידת מוצא הפוכה כללית מס' 1. הגנה פנימית באמת ימין, שיכול ובעיטה לצד לברך התוקף"
        "הגנה פנימית נגד בעיטת מגל לפנים — בעיטה לאחור" ->  "עמידת מוצא הפוכה כללית מס' 1. הגנה פנימית באמת ימין. שיכול ובעיטה רגילה לאחור למפשעת התוקף"
        "הגנה פנימית באמת ימין נגד בעיטה לצד" ->  "עמידת מוצא הפוכה כללית מס' 1. בתנועה אחת הגנה פנימית באמת ימין והגנה חיצונית באמת שמאל תוך צעד בימין. הפניית גוף לצד החי והמשך התקפת גב יד ימין בהצלפה לפנים"


        else -> "הסבר מפורט על: $item"
    }
}

// ─────────── חגורה חומה ───────────
private fun getBrown(item: String): String {
    return when (item) {

// ─────────── בעיטות בניתור ───────────
        "בעיטה רגילה ובעיטת מגל בניתור" -> "בעיטה רגילה. עם החזרת הרגל הבועטת. ניתור ברגל הבסיס ובעיטת מגל ברגל הבסיס"
        "בעיטת מגל בניתור" -> "ניתור ברגל הבסיס ובעיטת מגל ברגל השניה. בעת הבעיטה יש לקרב את רגל הבסיס לעכוז"
        "בעיטת מגל כפולה בניתור" -> "עיטת מגל אופקית. רגל עוברת מטרה ויורדת לפנים, ניתור תוך סיבוב הגוף וניצול תנועת בעיטת המגל הראשונה לבעיטת המגל השניה"

        // ─────────── בלימות וגלגולים ───────────
        "גלגול עם רובה" -> "הנחת קת הרובה על הקרקע. זווית חדה בין תחתית הרובה לקרקע. גלגול ימין. 3 אפשרויות סיום: שכיבה, כריעה, עמידה"

        // ─────────── הגנות נגד בעיטות  ───────────
        "הגנה פנימית נגד בעיטה לסנטר" ->   "עמידת מוצא כללית מס' 1. הגנה פנימית באמת שמאל. צעד בשמאל לצד המת תוך הפניית גוף, רצף של התקפות בהתאם למרחק התוקף"
        "הגנה חיצונית נגד בעיטה רגילה – פריצה" ->   "עמידת מוצא כללית מס' 1. הגנה חיצונית - דקירה רחוקה מהגוף באמת ימין. פריצה ברגל שמאל תוך המשך התנועה להרמת הרגל הבועטת. הדיפת התוקף לאחור ביד שמאל להטלה"
        "הגנה חיצונית נגד בעיטה רגילה – גזיזה" ->   "עמידת מוצא כללית מס' 1 נמוכה. הגנה חיצונית - דקירה רחוקה מהגוף באמת ימין. פריצה ברגל שמאל תוך המשך התנועה להרמת הרגל הבועטת. גזיזה אחורית ברגל ימין להפלת התוקף. (הגזיזה - תלויה במנח הגוף לאחר הפריצה)"
        "הגנה חיצונית נגד בעיטה רגילה – טאטוא" ->  "עמידת מוצא כללית מס' 1 נמוכה. הגנה חיצונית - דקירה רחוקה מהגוף באמת ימין. פריצה ברגל שמאל תוך הפניית גוף בניצב לתוקף והמשך התנועה להרמת הרגל הבועטת. טאטוא בצד הפנימי של רגל שמאל להפלת התוקף. (הטאטוא - תלוי במנח הגוף לאחר הפריצה)"
        "הגנה פנימית נגד בעיטה רגילה – טאטוא" ->  "עמידת מוצא כללית מס' 2. הגנה פנימית ביד שמאל. צעד בשמאל. אחיזת זרוע התוקף ואגרוף ימין לפנים, העברת משקל וטאטוא ברגל שמאל. (לאחר נפילת התוקף המשך תנועה עם הגוף בסיבוב ובעיטה ברגל ימין לראש התוקף)"
        "הגנה נגד בעיטת מגל – פריצה" ->  "עמידת מוצא כללית מס' 2. הגנה חיצונית - דקירה רחוקה מהגוף באמת שמאל. פריצה ברגל שמאל תוך המשך התנועה להרמת הרגל הבועטת. הדיפת התוקף לאחור ביד ימין להטלה"
        "הגנה נגד בעיטת מגל לפנים – גזיזה" ->  "עמידת מוצא כללית מס' 2. הגנה חיצונית - דקירה רחוקה מהגוף באמת שמאל. פריצה ברגל שמאל תוך המשך התנועה להרמת הרגל הבועטת. גזיזה אחורית ברגל ימין להפלת התוקף. (הגזיזה - תלויה במנח הרגל לאחר הפריצה)"
        "הגנה חיצונית נגד מגל לפנים – טאטוא" ->  "עמידת מוצא כללית מס' 2. הגנה חיצונית - דקירה רחוקה מהגוף באמת שמאל. פריצה ברגל שמאל תוך הפניית גוף בניצב לתוקף והמשך התנועה להרמת הרגל הבועטת. טאטוא בצד הפנימי של רגל ימין להפלת התוקף. (הטאטוא - תלוי במנח הרגל לאחר הפריצה)"
        "הגנה נגד בעיטת מגל לאחור – פריצה" -> "עמידת מוצא כללית מס' 1. הגנה חיצונית - דקירה רחוקה מהגוף באמת ימין ושמירת פנים ביד שמאל תוך פריצה ברגל שמאל והדיפת התוקף לאחור ביד שמאל להפלתו"

        // ─────────── שחרורים ───────────
        "חביקת צוואר מאחור – בריח על השורף, המגן כפוף לפנים" -> "יד ימין מאונקלת תופסת את אמת התוקף תוך הפנית ראש לכיון שקע המרפק. יד שמאל דוחפת מלמטה את מרפק התוקף כלפי מעלה. לרדת על הברכיים ולהמשיך לגלגול בלי ידיים"

        // ─────────── הגנות נגד מקל ───────────
        "הגנה נגד מקל בסיבוב – צד חי" -> "פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן פריצה ברגל שמאל. ביד שמאל חביקת היד האוחזת במקל. ביד ימין מרפק אופקית לפנים תוך צעד בימין והמשך תנועת ההתפרצות בסיבוב להורדת התוקף. לקיחת המקל (יש ללמוד גם בשמאל)"
        "הגנה נגד מקל עם קוואלר – צד מת" -> "פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן פריצה ברגל שמאל. הורדת יד התוקף בהחלקת שתי הידיים לשורש כף יד התוקף. תפיסת קוואלר. צעד בשמאל לאחור. המשך תנועת הקוואלר בצעד ימין לאחור תוך הפניית גוף וצעד נוסף בשמאל לאחור בהפניית גוף ומנוף על מרפק התוקף להוצאת המקל (יש ללמוד גם בשמאל)"
        "הגנה נגד מקל נקודת תורפה – לצד המת" -> "פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן פריצה ברגל שמאל. צעד בימין לצד המת תוך הפניית גוף לאחור. תפיסת נקודת תורפה בראש ביד שמאל והורדת התוקף. (יש ללמד גם בשמאל)"

        // ─────────── הגנות נגד סכין ───────────
        "הגנה נגד סכין בשיסוף – הטיה והגנה לצד חי" -> "פיסוק קל. צעד לאחור בימין תוך הרמת ידיים לשמירת פנים כאשר כפות הידיים כלפי פנים. הגנה חיצונית בשמאל ותפיסת יד התוקף. צעד לפנים בימין ואגרוף ימין. (יש ללמד גם בשמאל)"
        "הגנה נגד סכין בשיסוף – הטיה והגנה לצד מת" -> "פיסוק קל. צעד לאחור בימין תוך הרמת ידיים לשמירת פנים כאשר כפות הידיים כלפי פנים. הגנה חיצונית בימין כנגד יד התוקף תוך צעד בשמאל והפנית גוף בסיבוב 180 מעלות לצד המת. תפיסת נקודת תורפה בראש ביד שמאל והורדת התוקף תוך הקפדה להצמדת המרפק לגוף. (יש ללמד גם בשמאל)"
        "הגנה נגד סכין בשיסוף – פריצה והגנה לצד חי" ->  "פיסוק קל. פריצה בשמאל ימינה מחוץ לרגלי התוקף, תוך הגנה חיצונית ביד שמאל והמשך התנועה לתפיסת יד התוקף. מכת פיסת יד ימין מהצד והמשך התנועה כלפי מטה תוך סיבוב והורדת התוקף. (יש ללמד גם בשמאל)"
        "הגנה נגד סכין בשיסוף – פריצה והגנה לצד המת" -> "פיסוק קל. פריצה בשמאל תוך הגנה באמת ימין כנגד יד התוקף. הפניית גוף בסיבוב 180 מעלות לצד המת. תפיסת נקודת תורפה בראש ביד שמאל והורדת התוקף עם מנוף על המרפק (עד לפריקת מרפק). (יש ללמד גם בשמאל)"

        // ─────────── הגנות מאיום אקדח ───────────
        "הגנה מאיום אקדח מלפנים ימין" -> "הרמת יד שמאל מלמטה למעלה ואל התוקף להסטת יד התוקף הצידה ולמטה לכיון ירך שמאל תוקף תוך הצמדות לתוקף ונעית היד כלפי מטה. צעד בימין תוך לפיתת הקנה ואגרוף ימין לפנים. יד ימין מצטרפת מאחור לאחיזת האקדח באזור הפטיש. רבע סיבוב האקדח ליצירת בריח על יד התוקף. פריקה. צעדים לאחור תוך איום על התוקף. (יש ללמד גם בשמאל)"
        "הגנה מאיום אקדח מהצד הפנימי – תוקף בצד" -> "שתי ידיים מסיטות בתנועה אחת: ביד ימין - הסטת היד האוחזת באקדח תוך תפיסת שורש כף היד. ביד שמאל לפיתת האקדח קנה. צעד בימין לצד החי תוך נגיחה או מכת כתף ופריקת האקדח. צעדים לאחור תוך איום על התוקף. (יש ללמד גם בשמאל)"
        "הגנה מאיום אקדח מהצד הפנימי – תוקף בצד שמאל" -> "שתי ידיים מסיטות בתנועה אחת: ביד ימין - הסטת היד האוחזת באקדח תוך תפיסת שורש כף היד. ביד שמאל לפיתת האקדח קנה. צעד בשמאל לצד המת. פריקת האקדח תוך בריח על שורש כף היד ומכת מרפק לגוף התוקף תוך הפניית עקב ואגן ימין, צעדים לאחור תוך איום על התוקף. (יש ללמד גם בשמאל)"
        "הגנה מאיום אקדח מהצד החיצוני" -> "הושטת יד שמאל רחוק מהגוף תוך צעד לפנים בימין. תפיסת יד התוקף והצמדתה בין האמה לזרוע מתחת לגובה הכתף. אגרוף ימין. ברך ימין. מכת מרפק אופקית בימין. פריקת האקדח ומכת קנה לפנים, צעדים לאחור תוך איום על התוקף. (יש ללמד גם בשמאל)"
        "הגנה מאיום אקדח מאחור" ->  "מבט לאחור. הושטת יד שמאל רחוק מהגוף תוך צעד לאחור וסיבוב הגוף לצד החי. ביד מאונקלת תפיסת יד התוקף והצמדתה בין האמה לזרוע מתחת לגובה הכתף. אגרוף ימין. ברך ימין. מכת מרפק אופקית בימין. פריקת האקדח ומכת קנה לפנים. צעדים לאחור תוך איום על התוקף. (יש ללמד גם בשמאל)"


        else -> "הסבר מפורט על: $item"
    }
}

private fun getBlack(item: String): String {
    return when (item) {
                            // ─────────── חגורה שחורה ───────────
    // ─────────── בעיטות בניתור ───────────
        "ניתור ברגל שמאל ובעיטה רגילה ברגל ימין" -> "ניתור ברגל שמאל. בעיטה רגילה בימין תוך כיפוף ברך שמאל וקירוב עקב שמאל לעכוז. נחיתה על רגל שמאל וימין מצטרפת (לתרגל גם בימין)"
        "ניתור ברגל שמאל ובעיטה לצד ברגל ימין" -> "ניתור ברגל שמאל. כף הרגל לצד - אצבעות הרגל פונות שמאלה. הפניית הגוף בניתור כשצד ימין של הגוף פונה לתוקף ובעיטה לצד בימין תוך כיפוף ברך שמאל וקירוב עקב ימין לעכוז (לתרגל גם בימין)"
        "ניתור ברגל שמאל ובעיטה לצד ברגל שמאל" -> "ניתור ברגל שמאל. כף הרגל לצד - אצבעות הרגל פונות ימינה. הפניית הגוף בניתור כשצד שמאל פונה לתוקף, החלפת רגליים (מספרת), ובעיטה לצד ברגל שמאל תוך כיפוף ברך ימין וקירוב עקב שמאל לעכוז (לתרגל גם בימין)"
        "בעיטת לצד בסיבוב מלא בניתור" -> "ניתור בסיבוב ובעיטה לצד ברגל השנייה"
        "בעיטת מגל לאחור בסיבוב בניתור" -> "ניתור בסיבוב ובעיטת מגל לאחור ברגל השנייה"
        "בעיטת הגנה לאחור בניתור" -> "ניתור בסיבוב ובעיטת הגנה לאחור ברגל השנייה"

    // ─────────── מכות במקל קצר ───────────
        "מכת מקל לראש" ->  "חסר הסבר בחוברת תרגילי ק.מ.י"
        "מכת מקל לרקה" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "מכת מקל ללסת / צוואר" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "מכת מקל לעצם הבריח" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "מכת מקל למפרק" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "מכת מקל לשורש כף היד" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "מכת מקל לפרקי האצבעות" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "מכת מקל לברך" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "מכת מקל למפסעה" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "הצלפת מקל לצלעות" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "דקירת מקל חיצונית לצלעות" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "דקירת מקל ישרה לבטן / לגרון" -> "חסר הסבר בחוברת תרגילי ק.מ.י"
        "דקירת מקל הפוכה" -> "חסר הסבר בחוברת תרגילי ק.מ.י"

            // ─────────── מכות במקל / רובה ───────────
            "מכה לאחור" -> "עמידת מוצא רגילה. דקירה לאחור. המכה בקת או בחלק האחורי של המקל"
            "מכה אופקית לאחור" -> "עמידת מוצא רגילה. מכה אופקית לאחור בקת או בחלק האחורי של המקל תוך סיבוב עקב שמאל"
            "מכה אופקית ובעיטה רגילה למפסעה" -> "עמידת מוצא רגילה. מכה אופקית ובעיטה רגילה ברגל האחורית למפסעה"
            "מכה אופקית ובעיטת הגנה לפנים" -> "עמידת מוצא רגילה. מכה אופקית ובעיטת הגנה לפנים"
            "מכה לצד ובעיטה לצד" -> "פיסוק קל. מכה לצד. שיכול אחורי ובעיטה לצד לגובה הברך"
            "מכת סנוקרת" -> "עמידת מוצא רגילה. מכת סנוקרת לסנטר בקת או בקצה האחורי של המקל תוך סיבוב עקב ימין"
            "מכה לצד" -> "פיסוק קל. מכה לצד בקת או בקצה האחורי של המקל"
            "מכה אופקית לצוואר" ->"עמידת מוצא רגילה. צעד בשמאל והתקפה אופקית לפנים / צוואר התוקף עם המחסנית או ידית האחיזה או גוף הרובה / מקל"
            "דקירה" -> "עמידת מוצא רגילה. דקירה בכידון או בקצה הקדמי של המקל (תנועת הגוף בדומה לדקירה ישרה עם סכין)"
            "מכת מגל" -> "עמידת מוצא רגילה. מכת מגל בקת או בקצה האחורי של המקל תוך סיבוב עקב ימין"
            "שיסוף" -> "עמידת מוצא רגילה. שיסוף בצד המכודן או בקצה הקדמרי של המקל תוך סיבוב עקב שמאל"
            "מכת למפסעה" -> "עמידת מוצא רגילה. מכה בקת או בקצה האחורי של המקל למפסעה תוך סיבוב עקב ימין"

            // ─────────── שחרורים מחביקות צואר ───────────
            "שחרור מחביקת צואר מהצד - משיכה לאחור" -> "עם המשיכה לאחור, יד לנקודת תורפה בראש התוקף תוך העברת הרגל הקרובה מאחורי רגלי התוקף. נפילה עם התוקף לאחור והתקפה"
            "שחרור מחביקת צואר מהצד - יד תפוסה" -> "היד הקרובה לתוקף נמצאת מלפנים ורגלי התוקף נמצאות לפני רגלי המגן. א: התוקף במכנסיים ארוכים - שתי ידיים תופסות מלפנים בשוקיים, קרוב לברך, הרמה, נפילה עם התוקף לאחור והתקפה. ב: התוקף במכנסיים קצרים - שתי ידיים תופסות את רגלי התוקף מאחור מתחת שקע הברך, הרמה, נפילה עם התוקף לאחור והתקפה"
            "שחרור מחביקת צואר מהצד - זריקת רגל" -> "עם הנפילה לפנים, הרגל מושחלת בין רגלי התוקף תוך שכיבה על הגב. התקפה למפסעה ביד הפנויה והפיכת התוקף לאחור"
            "שחרור מחביקת צואר מהצד - מהברך" -> "ביד הקרובה מכה למפסעה. יד שנייה עולה מאחור לנק' תורפה בראש. משיכה לאחור להפלת התוקף"

            // ─────────── שחרורים מתפיסות נלסון ───────────
                "שחרור מתפיסת נלסון" -> "הצמדת מרפקים ולחיצת הידיים כלפי מטה לתפיסת ידי התוקף. הוצאת מותן והעברת רגל מאחורי רגל התוקף. דחיפת ברך אל שקע ברך התוקף ונפילה לאחור תוך אחיזת ידי התוקף. מכה למפסעה או מרפק לסרעפת לאחר הנפילה. הערה: יש להמם את התוקף במידה וברמה שתאפשר לעזוב בבטחה את המקום"

            // ─────────── שחרורים מחביקות גוף ───────────
            "שחרור מחביקה סגורה מהצד" -> "ביד הקרובה מכה למפסעה והמשך התנועה למכת מרפק גבוהה"
            "שחרור מחביקה סגורה מהצד - היד הרחוקה משוחררת" -> "א: ראש התוקף לפני גוף המגן - ביד הרחוקה אגרופים לפנים. ב: ראש התוקף מאחורי גוף המגן - מכה למפסעה והמשך התנועה למכת מרפק גבוהה, רקיעה על גב הרגל"
            "שחרור מחביקה פתוחה מהצד" -> "ברך למפשעה, מכת מרפק לפנים, או נגיחה"
            "שחרור מחביקה פתוחה מאחור - הטלה" -> "כיפוף גב וברכיים תוך הרמת שתי הידיים ואחיזת אמת ימין תוקף קרוב לזרוע. הוצאת רגל ימין למניעת התחמקות התוקף תוך הפניית הרגל פנימה על כרית כף הרגל. משיכה והפלת התוקף לפנים"
            "שחרור מחביקה סגורה מאחור - הטלה" -> "כיפוף גב וברכיים תוך הרמת שתי הידיים לאחיזת ידי התוקף. ראש הצידה וגלגול לפנים ללא ידיים באחיזת התוקף"

                // ─────────── הגנות – מספר תוקפים ───────────
            "1 מקל 1 סכין – מקל בצד חי" -> "הגנה נגד מקל בסיבוב תוך מבט אל התוקף השני. (והשתלטות על המקל) והמשך בתרגיל הגנה נגד דקירת הסכין."
            "1 מקל 1 סכין – מקל בצד מת" -> "**א:** הגנה נגד מקל עם קוואלר תוך מבט אל התוקף השני (והשתלטות על המקל) והמשך בתרגיל הגנה נגד דקירת הסכין. **ב:** הגנה נגד מקל, נק' תורפה בראש והורדה לאחור תוך לחץ על מרפק התוקף (פריקת מרפק) כנגד חזה המגן, מבט אל התוקף השני (והשתלטות על המקל) והמשך בתרגיל הגנה נגד דקירת הסכין."
            "1 מקל 1 סכין – במקרה והסכין קרוב" -> "הגנה נגד סכין תוך מבט אל התוקף השני והגנה נגד מקל."
            "הדמיה כנגד 2 תוקפים" -> "על המתאמן להרכיב 2 תרגילי סימולציה נגד 2 אנשים (1 עם נשק ו-1 ללא נשק)."

                // ─────────── הגנות מאיום אקדח ───────────
            "הגנה נגד איום אקדח לראש מלפנים" -> "הרמת יד שמאל מלמטה למעלה ואל התוקף להסטת יד התוקף הצידה ולמטה לכיון ירך שמאל תוקף תוך הצמדות לתוקף ונעית היד כלפי מטה. צעד בימין תוך לפיתת הקנה ואגרוף ימין לפנים. יד ימין מצטרפת מאחור לאחיזת האקדח באזור הפטיש. רבע סיבוב האקדח ליצירת בריח על יד התוקף. פריקה. צעדים לאחור תוך איום על התוקף. (יש ללמד גם בשמאל)."
            "הגנה נגד איום אקדח צמוד לראש מלפנים" -> "הרמת יד שמאל מלמטה והסטת יד התוקף הצידה ולמטה לכיון ירך שמאל תוקף תוך הצמדות לתוקף ונעית היד כלפי מטה. צעד בימין תוך לפיתת הקנה ואגרוף ימין לפנים. יד ימין מצטרפת מאחור לאחיזת האקדח באזור הפטיש. רבע סיבוב האקדח ליצירת בריח על יד התוקף. פריקה. צעדים לאחור תוך איום על התוקף. (יש ללמד גם בשמאל)."
            "הגנה נגד איום אקדח מלפנים – קנה קצר" -> "יד שמאל אוחזת בשורש כף יד התוקף, גב יד שמאל כלפי מעלה. יד ימין חובקת את האגרוף האוחז באקדח. באחיזת קואלר. הפניית הקנה אל התוקף תוך בעיטה בימין למפסעה והמשך הקוואלר להפלת התוקף (יש ללמד גם בשמאל)."
            "הגנה נגד איום אקדח לראש – צד ימין" -> "**א:** יד התוקף לפני יד המגן - ביד שמאל הסטת האקדח לכיוון ירך שמאל תוקף, צעד בשמאל לצד המת ואגרוף בימין. **ב:** יד התוקף מאחורי יד המגן - ביד ימין מאונקלת, מלמעלה, משיכת יד האקדח מתחת לקו הכתף, צעד בשמאל לצד המת ואגרוף שמאל לפנים. **ג:** יציאה לצד החי - ביד ימין הסטת האקדח לפנים ולמטה תוך צעד בימין לצד החי ואגרוף שמאל לפנים. (יש ללמד גם בשמאל)."
            "הגנה נגד איום אקדח לראש – צד שמאל" -> "**א:** יד התוקף לפני יד המגן - ביד שמאל הסטת האקדח לכיוון ירך שמאל תוקף, צעד בשמאל לצד המת ואגרוף בימין. **ב:** יד התוקף מאחורי יד המגן - ביד שמאל מאונקלת, מלמעלה, משיכת יד האקדח מתחת לקו הכתף, צעד בימין לצד המת ואגרוף ימין לפנים. **ג:** יציאה לצד החי - ביד שמאל הסטת האקדח לפנים ולמטה תוך צעד בשמאל לצד המת ואגרוף ימין לפנים. (יש ללמד גם בשמאל)."
            "הגנה נגד איום אקדח לראש מהצד מאחור – צד שמאל" -> "מבט לצד. הושטת יד שמאל רחוק מהגוף תוך צעד בימין וסיבוב הגוף לצד החי. תפיסת יד התוקף והצמדתה בין האמה לזרוע מתחת לגובה הכתף. אגרוף ימין. ברך ימין. מכת מרפק אופקית בימין. פריקת האקדח ומכת קנה לפנים. צעדים לאחור תוך איום על התוקף. (יש ללמד גם בשמאל)."
            "הגנה מאיום אקדח בהובלה" -> "צעד ימין תוך סיבוב והפניית גוף לצד התוך. יד שמאל בתנועה כלפי מעלה להצמדת יד האקדח לגוף התוקף. הצמדת אוזן שמאל לגב התוקף תוך הכנסת יד ימין בין רגלי התוקף. הרמת התוקף תוך משיכתו לאחור ביד ימין להורדתו לקרקע. רכיבה בהצלבה ומעבר לנתיקת ברכיבה (יד שמאל). (יש ללמד גם בשמאל)"
            "הגנה נגד איום אקדח לראש מאחור" -> "הושטת יד שמאל רחוק מהגוף תוך צעד לאחור וסיבוב הגוף לצד החי. תפיסת יד התוקף והצמדת בין האמה לזרוע מתחת לגובה הכתף. אגרוף ימין, ברך ימין. מכת מרפק אופקית בימין. פריקת האקדח ומכת קנה לפנים. צעדים לאחור תוך איום על התוקף. דגש: אין מבט לאחור. (יש ללמד גם בשמאל)"
            "הגנה נגד איום אקדח מאחור בידיים מורמות" -> "ידיים למעלה. מבט לאחור. סיבוב לצד החי. ביד שמאל מלמעלה חבקות היד המאיימת קרוב לשרש כף יד התוקף צעד ביימון תוך מכת מרפק אופקית מהצד בסיבוב והפלת התוקף. (יש ללמד גם בשמאל)"

                // ─────────── הגנות נגד מכות בשילוב בעיטות ───────────
        "הגנה פנימית נגד אגרוף שמאל – בעיטת הגנה" -> "הגנה פנימית בימין ובעיטת הגנה בימין לפנים למרכז הגוף"
        "הגנה פנימית נגד אגרוף שמאל – בעיטה לצד" -> "הגנה פנימית בימין. שיכול ובעיטה לצד בימין לברך התוקף"
        "הגנה פנימית נגד אגרוף שמאל – בעיטה רגילה לאחור" -> "הגנה פנימית בימין. שיכול אחורי תוך הפניית גב ובעיטה רגילה לאחור בימין"
        "הגנה פנימית נגד אגרוף שמאל – בעיטת מגל לאחור" -> "הגנה פנימית בימין ובעיטת מגל לאחור בימין"
        "הגנה פנימית נגד אגרוף שמאל – בעיטת סטירה חיצונית" -> "הגנה פנימית בימין ובעיטת סטירה חיצונית בימין"
        "הגנה פנימית נגד אגרוף שמאל – בעיטת מגל לפנים" -> "הגנה פנימית בימין ובעיטת מגל לפנים בימין"
        "הגנה פנימית נגד אגרוף שמאל – גזיזה קדמית" -> "הגנה פנימית בימין. שיכול תוך הפניית גוף וגזיזה קדמית בימין"
        "הגנה נגד בעיטה רגילה – התחמקות בסיבוב" -> "מידת מוצא כללית מס' 2 או פיסוק קל. הגנה פנימית ביד שמאל והמשך תנועת היד להרמת הרגל הבועטת תוך התחמקות לצד המת בחצי סיבוב. צעדים לאחור תוך הרמת היד האוחזת והפלת התוקף לאחור. במידה והתוקף לא נפל, רגל שמאל באלכסון לאחור ימינה תוך הפנית גוף לתוקף והחלפת אמת שמאל בכף יד ימין להמשך הדיפת התוקף לאחור להפלתו"
        "הגנה נגד בעיטת מגל לפנים לראש – הדיפה באמת שמאל" -> "עמידת מוצא להגנות חיצוניות. הגנה 360/1 באמת שמאל מתחת לרגל התוקף תוך התקדמות והדיפת התוקף לאחור להפלה"
        "הגנה נגד בעיטת מגל לפנים לראש – רגל עברה מעל הראש" -> "עמידת מוצא להגנות חיצוניות. הגנה 360/1 באמת שמאל מתחת לרגל התוקף ומכת סנוקרת למפסעה"
        "הגנה נגד מגל לפנים לראש – התחמקות גוף בסיבוב וגזיזה" -> "ירידה בסיבוב לאחור תוך הנחת ידיים וברך שמאל. בעיטת מגל נמוכה לאחור להפלת התוקף"
        "הגנה נגד בעיטת סטירה – גזיזה" -> "עמידת מוצא הפוכה כללית מס' 2. שיכול אחורי. גזיזה אחורית בימין תוך הדיפת רגל התוקף ביד ימין להפלתו"

            // ─────────── הגנות נגד מקל ───────────
        "הגנה נגד מקל ארוך – התקפה לצד ימין מגן" -> "פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן, פריצה ברגל שמאל, הורדת היד התוקפת בהחלקת שתי ידיים מעוקלות תוך הזזת רגל ימין לאחור והתקפה באגרוף ימין לפנים"
        "הגנה נגד מקל ארוך – התקפה לצד שמאל מגן" -> "פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן, פריצה ברגל שמאל. צעד בימין לפנים תוך הפניית גוף בניצב לתוקף ואגרוף ימין לפנים, או מרפק - בהתאם לטווח"
        "הגנה נגד מקל ארוך מצד ימין" ->"פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן פריצה ברגל שמאל. ליפוף יד ימין על שתי ידי התוקף. אגרוף שמאל מהצד (במצבים מסוימים מכת מרפק שמאל אופקית לפנים) תוך התחמקות בסיבוב להפלת התוקף. הוצאת המקל. (יש ללמד גם בשמאל)"
        "הגנה נגד מקל ארוך מצד שמאל" -> "פיסוק קל. בשתי ידיים ישרות וצמודות והראש מוגן פריצה ברגל שמאל. ליפוף יד שמאל על 2 ידי התוקף. צעד בימין ומכת מרפק אופקית לפנים תוך התחמקות בסיבוב להפלת התוקף. הוצאת המקל. (יש ללמד גם בשמאל)"
        "הגנה נגד דקירה במקל ארוך – הצד החי" -> "עמידת פיסוק. הסטת המקל בכף יד שמאל. התקדמות בשמאל תוך הפניית גוף והגנה בשתי האמות. תפיסת המקל בשתי ידיים. משיכת המקל כלפי מעלה תוך בעיטה למפסעה. (בריח על כף יד התוקף לכיוון הצוואר. הפלת התוקף ולקיחת המקל)"
        "הגנה נגד דקירה במקל ארוך – הצד המת" -> "עמידת פיסוק. הסטת המקל בכף יד ימין ואחיזתו ביד שמאל תוך צעד בימין ובעיטה למפסעה בשמאל. (אגרוף ימין לעורף התוקף. גזיזה קדמית בימין. הוצאת המקל בסיבוב תוך הפלת התוקף. מכת בקצה המקל לפנים)"

    // ─────────── הגנות נגד סכין ───────────
        "הגנה נגד סכין שיסוף מהצד החי – בצד ימין" -> "הגנה חיצונית באמת ימין ובעיטה לצד בימין תוך הטעיית הגוף שמאלה"
        "הגנה נגד סכין שיסוף מהצד החי – בצד שמאל" -> "הגנה חיצונית באמת שמאל ובעיטה לצד בשמאל תוך הטעיית הגוף ימינה"
        "הגנה נגד סכין שיסוף מהצד המת – בצד ימין" -> "הגנה חיצונית באמת ימין ובעיטה לצד בימין תוך הטעיית הגוף שמאלה"
        "הגנה נגד סכין שיסוף מהצד המת – בצד שמאל" -> "הגנה פנימית באמת שמאל ובעיטה לצד בשמאל תוך הטעיית הגוף ימינה"

    // ─────────── הגנות – מקל נגד סכין ───────────
        "הגנת מקל נגד סכין בתפיסה רגילה" -> "צעד בימין לצד החי תוך הגנת גוף והתקפה במקל לגרון. (יש ללמד גם בשמאל)"
        "הגנת מקל נגד סכין בתפיסה מזרחית" -> "הגנה במקל על שורש כף יד התוקף והתקפה במקל לראש. (יש ללמד גם בשמאל)"
        "הגנת מקל נגד סכין בתפיסה ישרה" -> "הגנת גוף תוך הסטה במקל על שורש כף יד התוקף והתקפה במקל לראש. (יש ללמד גם בשמאל) "
        "הגנת מקל נגד סכין בתפיסה רגילה – צד ימין" ->  "הגנה חיצונית במקל על שרש כף יד התוקף תוך יציאה לצד החי והתקפה באגרוף שמאל. המשך התקפות במקל (יש ללמד גם בשמאל)"
        "הגנת מקל נגד סכין בתפיסה רגילה – צד שמאל" -> "הגנה חיצונית ביד שמאל. צעד בימין והתקפה במקל. (יש ללמד גם בשמאל)"
        "הגנת מקל נגד סכין בתפיסה מזרחית – צד ימין" -> "הגנה במקל על שורש כף יד התוקף והתקפה במקל לגרון. (יש ללמד גם בשמאל)"
        "הגנת מקל נגד סכין בתפיסה מזרחית – צד שמאל" -> "הגנה חיצונית ביד שמאל. צעד בימין והתקפה במקל. (יש ללמד גם בשמאל)"
        "הגנה פנימית במקל נגד סכין בתפיסה ישרה – צד ימין" -> "הגנה פנימית במקל על שורש כף יד התוקף תוך צעד בימין לצד החי והמשך התקפות עם המקל. (יש ללמד גם בשמאל)"
        "הגנה חיצונית במקל נגד סכין בתפיסה ישרה – צד ימין" -> "הגנה חיצונית במקל על שרש כף יד התוקף. צעד בשמאל ואגרוף שמאל לפנים. (יש ללמד גם בשמאל)"
        "הגנה פנימית במקל נגד סכין בתפיסה ישרה – צד שמאל" -> "הסטה ביד שמאל. צעד בשמאל לצד המת והתקפה במקל. (יש ללמד גם בשמאל)"
        "הגנה חיצונית במקל נגד סכין בתפיסה ישרה – צד שמאל" -> "הגנה חיצונית ביד שמאל. צעד בימין והתקפה בימין. (יש ללמד גם בשמאל)"
        "מקל בתנועה" -> "שימוש במקל כאמצעי הטעייה בקרב נגד סכין. (יש ללמד גם בשמאל)"
        "שימוש בסכין" -> "שימוש בסכין כאמצעי הטעיה (אין שימוש בסכין למטרת דקירה). (יש ללמד גם בשמאל)"

    // ─────────── הגנה עם רובה נגד סכין ───────────
        "רובה נגד דקירה ישירה גבוהה" -> "עמידת מוצא רגילה. הסטה בקנה תוך התקדמות לצד החי ודקירה"
        "רובה נגד דקירה ישירה נמוכה" -> "עמידת מוצא רגילה. הסטה בקת. מכת שיסוף בקנה ומכת מגל בקת"
        "רובה נגד דקירה רגילה" -> "עמידת מוצא רגילה. חסימת הדקירה באלכסון תוך צעד בימין לפנים ומכת קת / דקירה"
        "רובה נגד דקירה מזרחית מימין" -> "עמידת מוצא רגילה. חסימת הדקירה ימינה ודקירה בקנה"
        "רובה נגד דקירה מזרחית משמאל" -> "עמידת מוצא רגילה. חסימת הדקירה שמאלה. צעד בימין תוך הפניית גוף. ומכת קת"
        "רובה נגד דקירה מזרחית מלמטה" -> "עמידת מוצא רגילה. חסימת הדקירה ומכת רובה אופקית לפנים"

    // ─────────── הגנה מאיום תמ"ק ───────────
        "הגנה נגד איום תת־מקלע" -> "גלגול ברחיפה אל התוקף. עליה על ברך ופריצה אל התוקף. ברכיים כפופות משני צידי התוקף ולפיתת התוקף. הצמדת לחי לגב התוקף כשיד שמאל חובקת את הנשק מלטה למעלה באלכסון לכיוון הכתף הנגדית של התוקף וביד מאונקלת מחליקה כלפי מטה ומצמידה את הנשק אל גוף התוקף. אמת ימין נכנסת בין רגלי התוקף במכה למטה למעלה תוך יישור הברכיים והוצאת התוקף משיווי משקל במשיכת ימין לאחור. הפלת התוקף לפנים ועליה על התוקף בהצלבה. מעבר לשכיבה מלאה על התוקף. היד שבין רגלי התוקף עוברת לחביקת צוואר והיד השנייה נועלת את החביקה"


        else -> "הסבר מפורט על: $item"
    }
}
